[
  {
    "titleNumber": "III",
    "subtitle": "G",
    "sectionNumber": "30061",
    "sectionTitle": "Limitation on Authority of the Secretary to Propose or Issue Regulations and Executive Actions",
    "sectionText": "SEC. 30061. LIMITATION ON AUTHORITY OF THE SECRETARY TO PROPOSE OR \r\n              ISSUE REGULATIONS AND EXECUTIVE ACTIONS.\r\n\r\n    Part G of title IV of the Higher Education Act of 1965 (20 U.S.C. \r\n1088 et seq.) is amended by inserting after section 492 the following:\r\n\r\n``SEC. 492A. LIMITATION ON AUTHORITY OF THE SECRETARY TO PROPOSE OR \r\n              ISSUE REGULATIONS AND EXECUTIVE ACTIONS.\r\n\r\n    ``(a) Draft Regulations.--Beginning on the date of enactment of \r\nthis section, a draft regulation implementing this title (as described \r\nin section 492(b)(1)) that is determined by the Secretary to be \r\neconomically significant shall be subject to the following requirements \r\n(regardless of whether negotiated rulemaking occurs):\r\n            ``(1) The Secretary shall determine whether the draft \r\n        regulation, if implemented, would result in an increase in a \r\n        subsidy cost.\r\n            ``(2) If the Secretary determines under paragraph (1) that \r\n        the draft regulation would result in an increase in a subsidy \r\n        cost, then the Secretary may not take any further action with \r\n        respect to such regulation.\r\n    ``(b) Proposed or Final Regulations and Executive Actions.--\r\nBeginning on the date of enactment of this section, the Secretary may \r\nnot issue a proposed rule, final regulation, or executive action \r\nimplementing this title if the Secretary determines that the rule, \r\nregulation, or executive action--\r\n            ``(1) is economically significant; and\r\n            ``(2) would result in an increase in a subsidy cost.\r\n    ``(c) Relationship to Other Requirements.--The analyses required \r\nunder subsections (a) and (b) shall be in addition to any other cost \r\nanalysis required under law for a regulation implementing this title, \r\nincluding any cost analysis that may be required pursuant to Executive \r\nOrder 12866 (58 Fed. Reg. 51735; relating to regulatory planning and \r\nreview), Executive Order 13563 (76 Fed. Reg. 3821; relating to \r\nimproving regulation and regulatory review), or any related or \r\nsuccessor orders.\r\n    ``(d) Definition.--In this section, the term `economically \r\nsignificant', when used with respect to a draft, proposed, or final \r\nregulation or executive action, means that the regulation or executive \r\naction is likely, as determined by the Secretary--\r\n            ``(1) to have an annual effect on the economy of \r\n        $100,000,000 or more; or\r\n            ``(2) to adversely affect in a material way the economy, a \r\n        sector of the economy, productivity, competition, jobs, the \r\n        environment, public health or safety, or State, local, or \r\n        tribal governments or communities.''.",
    "summary": "Amends the Higher Education Act to bar the U.S. Secretary of Education from proposing, finalizing, or taking executive action on any Title IV student-aid rule that is both “economically significant” (≥ $100 million annual impact) and would raise the federal subsidy cost of aid programs.  The Department must perform a subsidy-cost screen at the draft stage; if the screen finds added cost the rule must be abandoned.  The restriction applies on top of existing cost-benefit reviews required by Executive Orders 12866 and 13563.",
    "impact": "•  Effectively freezes major new or updated student-aid regulations—such as repayment-plan changes, forgiveness frameworks, consumer-protection rules, or expanded eligibility—that would increase long-term credit-subsidy costs.  \n•  Shifts policy making on high-cost initiatives from the executive branch to Congress, reducing ED’s flexibility to respond to economic shocks or borrower-protection needs.  \n•  Could chill routine updates if the Department fears litigation over subsidy-cost estimates; critics argue it undermines negotiated rule-making and weakens oversight of predatory practices; supporters say it reins in executive overreach and protects taxpayers.",
    "additionalReferences": [
      "https://www.federalregister.gov/documents/1993/09/30/93-24554/executive-order-12866-regulatory-planning-and-review",
      "https://www.whitehouse.gov/wp-content/uploads/legacy_drupal_files/omb/circulars/A4/a-4.pdf",
      "https://crsreports.congress.gov/product/pdf/R/R47052",
      "https://www.gao.gov/assets/gao-20-170.pdf",
      "https://reginfo.gov/public/jsp/Utilities/faq.jsp"
    ],
    "tags": [
      "education",
      "student aid",
      "public assistance",
      "consumer protection",
      "oversight",
      "accountability",
      "loan forgiveness"
    ]
  }
]