[
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "1",
    "sectionNumber": "80101",
    "sectionTitle": "Onshore Oil and Gas Lease Sales",
    "sectionText": "SEC. 80101. ONSHORE OIL AND GAS LEASE SALES.\r\n\r\n    (a) Requirement to Immediately Resume Onshore Oil and Gas Lease \r\nSales.--\r\n            (1) In general.--The Secretary of the Interior shall \r\n        immediately resume quarterly onshore oil and gas lease sales in \r\n        compliance with the Mineral Leasing Act.\r\n            (2) Requirement.--The Secretary of the Interior shall \r\n        ensure--\r\n                    (A) that any oil and gas lease sale pursuant to \r\n                paragraph (1) is conducted immediately on completion of \r\n                all requirements under the Mineral Leasing Act; and\r\n                    (B) that the processes described in subparagraph \r\n                (A) are conducted in a timely manner to ensure \r\n                compliance with subsection (b)(1).\r\n            (3) Lease of oil and gas lands.--Section 17(b)(1)(A) of the \r\n        Mineral Leasing Act (30 U.S.C. 226(b)(1)(A)) is amended by \r\n        inserting ``Eligible lands comprise all lands subject to \r\n        leasing under this Act and not excluded from leasing by a \r\n        statutory or regulatory prohibition. Land shall be considered \r\n        available under the preceding sentence if the land has been \r\n        designated as open for leasing under a land use plan developed \r\n        or revised under section 202 of the Federal Land Policy and \r\n        Management Act of 1976 and has been nominated for leasing \r\n        through the submission of an expression of interest, is subject \r\n        to drainage (as described in subsection (j)) in the absence of \r\n        leasing, or is otherwise designated as available pursuant to \r\n        regulations issued by the Secretary.'' after ``sales are \r\n        necessary.''.\r\n    (b) Quarterly Lease Sales.--\r\n            (1) In general.--In accordance with the Mineral Leasing \r\n        Act, each fiscal year, the Secretary of the Interior shall \r\n        conduct a minimum of four oil and gas lease sales in each of \r\n        the following States:\r\n                    (A) Wyoming.\r\n                    (B) New Mexico.\r\n                    (C) Colorado.\r\n                    (D) Utah.\r\n                    (E) Montana.\r\n                    (F) North Dakota.\r\n                    (G) Oklahoma.\r\n                    (H) Nevada.\r\n                    (I) Alaska.\r\n                    (J) Any other State in which there is land \r\n                available for oil and gas leasing under the Mineral \r\n                Leasing Act or any other mineral leasing law.\r\n            (2) Requirement.--In conducting a lease sale under \r\n        paragraph (1) in a State described in that paragraph, the \r\n        Secretary of the Interior shall offer not less than 50 percent \r\n        of all parcels nominated that are available and eligible \r\n        pursuant to the requirements of the Mineral Leasing Act.\r\n            (3) Replacement sales.--The Secretary of the Interior shall \r\n        conduct a replacement sale during the same fiscal year if--\r\n                    (A) a lease sale under paragraph (1) is canceled, \r\n                delayed, or deferred, including for a lack of eligible \r\n                parcels; or\r\n                    (B) during a lease sale under paragraph (1) the \r\n                percentage of acreage that does not receive a bid is \r\n                equal to or greater than 25 percent of the acreage \r\n                offered.\r\n    (c) Leasing of Oil and Gas.--Section 17 of the Mineral Leasing Act \r\n(30 U.S.C. 226) is amended--\r\n            (1) by striking the section designation and all that \r\n        follows through the end of subsection (a) and inserting the \r\n        following:\r\n\r\n``SEC. 17. LEASING OF OIL AND GAS.\r\n\r\n    ``(a) Leasing.--\r\n            ``(1) In general.--Not later than 18 months after the date \r\n        of receipt by the Secretary of an expression of interest in \r\n        leasing land that is subject to disposition under this Act and \r\n        is known or believed to contain oil or gas deposits, the \r\n        Secretary shall, subject to paragraph (2), offer such land for \r\n        oil and gas leasing if the Secretary determines that the land \r\n        is open to oil or gas leasing under a land use plan developed \r\n        or revised under section 202 of the Federal Land Policy and \r\n        Management Act of 1976 (43 U.S.C. 1712) and such land use \r\n        plan--\r\n                    ``(A) applies to the planning area in which the \r\n                land is located; and\r\n                    ``(B) is in effect on the date on which the \r\n                expression of interest was submitted to the Secretary.\r\n            ``(2) Land use plans.--\r\n                    ``(A) Lease terms and conditions.--A lease issued \r\n                by the Secretary under this section--\r\n                            ``(i) shall include any terms and \r\n                        conditions of the land use plan that apply to \r\n                        the area of the lease; and\r\n                            ``(ii) shall not require any stipulations \r\n                        or mitigation requirements not included in such \r\n                        land use plan.\r\n                    ``(B) Effect of revisions.--The revision of a land \r\n                use plan shall not prevent or delay the Secretary from \r\n                offering land for leasing under this section if the \r\n                other requirements of this section have been met, as \r\n                determined by the Secretary.'';\r\n            (2) in subsection (p)--\r\n                    (A) in paragraph (1), by inserting ``conduct a \r\n                complete review of the application with all applicable \r\n                agency staff required for the Secretary to determine \r\n                the application is complete and'' after ``drill, the \r\n                Secretary shall''; and\r\n                    (B) by adding at the end the following:\r\n            ``(4) Term.--A permit to drill approved under this \r\n        subsection shall be valid for a single, nonrenewable 4-year \r\n        period beginning on the date that the permit to drill is \r\n        approved.\r\n            ``(5) Effect of pending civil action on processing \r\n        applications for permits to drill.--Pursuant to the \r\n        requirements of paragraph (2), notwithstanding the existence of \r\n        any pending civil actions affecting the application or a \r\n        related lease issued under this Act, the Secretary shall \r\n        process an application for a permit to drill or other \r\n        authorizations or approvals under a lease issued under this \r\n        Act.''; and\r\n            (3) by striking subsection (q) and inserting the following:\r\n    ``(q) Other Requirements.--In utilizing the authorities provided by \r\nsection 390 of the Energy Policy Act of 2005 with respect to an \r\nactivity conducted pursuant to this Act, the Secretary of the Interior \r\nshall not consider whether there are any extraordinary \r\ncircumstances.''.",
    "summary": "Locks Interior into quarterly lease auctions across at least ten Western and Gulf‑coast States (plus any others with available acreage).  Requires the Bureau of Land Management (BLM) to put up at least 50 % of all validly‑nominated parcels, mandates ‘make‑up’ sales if anything slips, and rewrites § 17 of the Mineral Leasing Act to force lease offerings within 18 months of nomination, curtail new stipulations, and cap drilling permits at four years.",
    "impact": "• **Regulatory triage & litigation risk.** 18‑month clocks and categorical‑exclusion mandates will almost guarantee truncated environmental analyses; the inevitable NEPA and ESA lawsuits could freeze entire sales—precisely the bottleneck the bill claims to fix.\n• **‘Field of dreams’ nominations.** By ordering BLM to auction half of all nominated parcels, the bill incentivizes speculative over‑nominating.  Industry can game the system—flood BLM with low‑value tracts, cherry‑pick what it actually wants, and leave taxpayers with the reclamation bill when marginal leases go idle.\n• **Tribal & surface‑owner blow‑back.** The new definition of ‘eligible lands’ sidesteps existing land‑use‑plan updates and ignores pending cultural‑resource surveys.  Expect sharper conflicts with tribes and private surface owners—delays that undercut the promise of ‘immediate’ production.\n• **Revenue story isn’t guaranteed.** More acreage does not equal more royalties.  CBO has repeatedly shown that auctioning low‑prospect parcels depresses bonus bids and administrative costs can exceed revenues on non‑producing leases.",
    "additionalReferences": [
      "https://www.blm.gov/programs/energy-and-minerals/oil-and-gas/leasing",
      "https://crsreports.congress.gov/product/pdf/IF/IF11558"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "1",
    "sectionNumber": "80102",
    "sectionTitle": "Noncompetitive Leasing",
    "sectionText": "SEC. 80102. NONCOMPETITIVE LEASING.\r\n\r\n    (a) Noncompetitive Leasing.--Section 17 of the Mineral Leasing Act \r\n(30 U.S.C. 226) is further amended--\r\n            (1) in subsection (b)--\r\n                    (A) in paragraph (1)(A)--\r\n                            (i) in the first sentence, by striking \r\n                        ``paragraph (2)'' and inserting ``paragraph (2) \r\n                        or (3)''; and\r\n                            (ii) by adding at the end ``Lands for which \r\n                        no bids are received or for which the highest \r\n                        bid is less than the national minimum \r\n                        acceptable bid shall be offered promptly within \r\n                        30 days for leasing under subsection (c) of \r\n                        this section and shall remain available for \r\n                        leasing for a period of 2 years after the \r\n                        competitive lease sale.''; and\r\n                    (B) by adding at the end the following:\r\n    ``(3)(A) If the United States held a vested future interest in a \r\nmineral estate that, immediately prior to becoming a vested present \r\ninterest, was subject to a lease under which oil or gas was being \r\nproduced, or had a well capable of producing, in paying quantities at \r\nan annual average production volume per well per day of either not more \r\nthan 15 barrels per day of oil or condensate, or not more than 60,000 \r\ncubic feet of gas, the holder of the lease may elect to continue the \r\nlease as a noncompetitive lease under subsection (c)(1).\r\n    ``(B) An election under this paragraph is effective--\r\n            ``(i) in the case of an interest which vested after January \r\n        1, 1990, and on or before October 24, 1992, if the election is \r\n        made before the date that is 1 year after October 24, 1992;\r\n            ``(ii) in the case of an interest which vests within 1 year \r\n        after October 24, 1992, if the election is made before the date \r\n        that is 2 years after October 24, 1992; and\r\n            ``(iii) in any case other than those described in clause \r\n        (i) or (ii), if the election is made prior to the interest \r\n        becoming a vested present interest.'';\r\n            (2) by striking subsection (c) and inserting the following:\r\n    ``(c) Lands Subject to Leasing Under Subsection (b); First \r\nQualified Applicant.--\r\n            ``(1) If the lands to be leased are not leased under \r\n        subsection (b)(1) of this section or are not subject to \r\n        competitive leasing under subsection (b)(2) of this section, \r\n        the person first making application for the lease who is \r\n        qualified to hold a lease under this chapter shall be entitled \r\n        to a lease of such lands without competitive bidding, upon \r\n        payment of a nonrefundable application fee of at least $75. A \r\n        lease under this subsection shall be conditioned upon the \r\n        payment of a royalty at a rate of 12.5 percent in amount or \r\n        value of the production removed or sold from the lease. Leases \r\n        shall be issued within 60 days of the date on which the \r\n        Secretary identifies the first responsible qualified applicant.\r\n            ``(2)(A) Lands (i) which were posted for sale under \r\n        subsection (b)(1) of this section but for which no bids were \r\n        received or for which the highest bid was less than the \r\n        national minimum acceptable bid and (ii) for which, at the end \r\n        of the period referred to in subsection (b)(1) of this section \r\n        no lease has been issued and no lease application is pending \r\n        under paragraph (1) of this subsection, shall again be \r\n        available for leasing only in accordance with subsection (b)(1) \r\n        of this section.\r\n            ``(B) The land in any lease which is issued under paragraph \r\n        (1) of this subsection or under subsection (b)(1) of this \r\n        section which lease terminates, expires, is cancelled or is \r\n        relinquished shall again be available for leasing only in \r\n        accordance with subsection (b)(1) of this section.''; and\r\n            (3) by striking subsection (e) and inserting the following:\r\n    ``(e) Primary Term.--Competitive and noncompetitive leases issued \r\nunder this section shall be for a primary term of 10 years: Provided, \r\nhowever, That competitive leases issued in special tar sand areas shall \r\nalso be for a primary term of 10 years. Each such lease shall continue \r\nso long after its primary term as oil or gas is produced in paying \r\nquantities. Any lease issued under this section for land on which, or \r\nfor which under an approved cooperative or unit plan of development or \r\noperation, actual drilling operations were commenced prior to the end \r\nof its primary term and are being diligently prosecuted at that time \r\nshall be extended for two years and so long thereafter as oil or gas is \r\nproduced in paying quantities.''.\r\n    (b) Failure to Comply With Provisions of Lease.--Section 31 of the \r\nMineral Leasing Act (30 U.S.C. 188) is amended--\r\n            (1) in subsection (d)(1), by striking ``section 17(b)'' and \r\n        inserting ``subsection (b) or (c) of section 17 of this Act'';\r\n            (2) in subsection (e)--\r\n                    (A) in paragraph (2)--\r\n                            (i) by inserting ``either'' after ``rentals \r\n                        and''; and\r\n                            (ii) by inserting ``or the inclusion in a \r\n                        reinstated lease issued pursuant to the \r\n                        provisions of section 17(c) of this Act of a \r\n                        requirement that future rentals shall be at a \r\n                        rate not less than $5 per acre per year, all'' \r\n                        before ``as determined by the Secretary''; and\r\n                    (B) by amending paragraph (3) to read as follows:\r\n            ``(3)(A) payment of back royalties and the inclusion in a \r\n        reinstated lease issued pursuant to the provisions of section \r\n        17(b) of this Act of a requirement for future royalties at a \r\n        rate of not less than 16\\2/3\\ percent computed on a sliding \r\n        scale based upon the average production per well per day, at a \r\n        rate which shall be not less than 4 percentage points greater \r\n        than the competitive royalty schedule then in force and used \r\n        for royalty determination for competitive leases issued \r\n        pursuant to such section as determined by the Secretary: \r\n        Provided, That royalty on such reinstated lease shall be paid \r\n        on all production removed or sold from such lease subsequent to \r\n        the termination of the original lease;\r\n            ``(B) payment of back royalties and inclusion in a \r\n        reinstated lease issued pursuant to the provisions of section \r\n        17(c) of this Act of a requirement for future royalties at a \r\n        rate not less than 16\\2/3 \\percent: Provided, That royalty on \r\n        such reinstated lease shall be paid on all production removed \r\n        or sold from such lease subsequent to the cancellation or \r\n        termination of the original lease; and'';\r\n            (3) in subsection (f)--\r\n                    (A) in paragraph (1), by striking ``in the same \r\n                manner as the original lease issued pursuant to section \r\n                17'' and inserting ``as a competitive or a \r\n                noncompetitive oil and gas lease in the same manner as \r\n                the original lease issued pursuant to subsection (b) or \r\n                (c) of section 17 of this Act'';\r\n                    (B) by adding at the end the following:\r\n    ``(4) Except as otherwise provided in this section, the issuance of \r\na lease in lieu of an abandoned patented oil placer mining claim shall \r\nbe treated as a noncompetitive oil and gas lease issued pursuant to \r\nsection 17(c) of this Act.'';\r\n            (4) in subsection (g), by striking ``subsection (d)'' and \r\n        inserting ``subsections (d) and (j)'';\r\n            (5) by amending subsection (h) to read as follows:\r\n    ``(h) Royalty Reductions.--\r\n            ``(1) In acting on a petition to issue a noncompetitive oil \r\n        and gas lease, under subsection (j) of this section or in \r\n        response to a request filed after issuance of such a lease, or \r\n        both, the Secretary is authorized to reduce the royalty on such \r\n        lease if in his judgment it is equitable to do so or the \r\n        circumstances warrant such relief due to uneconomic or other \r\n        circumstances which could cause undue hardship or premature \r\n        termination of production.\r\n            ``(2) In acting on a petition for reinstatement pursuant to \r\n        subsection (d) of this section or in response to a request \r\n        filed after reinstatement, or both, the Secretary is authorized \r\n        to reduce the royalty in that reinstated lease on the entire \r\n        leasehold or any tract or portion thereof segregated for \r\n        royalty purposes if, in his judgment, there are uneconomic or \r\n        other circumstances which could cause undue hardship or \r\n        premature termination of production; or because of any written \r\n        action of the United States, its agents or employees, which \r\n        preceded, and was a major consideration in, the lessee's \r\n        expenditure of funds to develop the property under the lease \r\n        after the rent had become due and had not been paid; or if in \r\n        the judgment of the Secretary it is equitable to do so for any \r\n        reason.''; and\r\n            (6) by adding at the end the following:\r\n    ``(j) Issuance of Noncompetitive Oil and Gas Lease; Conditions.--\r\nWhere an unpatented oil placer mining claim validly located prior to \r\nFebruary 24, 1920, which has been or is currently producing or is \r\ncapable of producing oil or gas, has been or is hereafter deemed \r\nconclusively abandoned for failure to file timely the required \r\ninstruments or copies of instruments required by section 1744 of title \r\n43, and it is shown to the satisfaction of the Secretary that such \r\nfailure was inadvertent, justifiable, or not due to lack of reasonable \r\ndiligence on the part of the owner, the Secretary may issue, for the \r\nlands covered by the abandoned unpatented oil placer mining claim, a \r\nnoncompetitive oil and gas lease, consistent with the provisions of \r\nsection 17(e) of this Act, to be effective from the statutory date the \r\nclaim was deemed conclusively abandoned. Issuance of such a lease shall \r\nbe conditioned upon--\r\n            ``(1) a petition for issuance of a noncompetitive oil and \r\n        gas lease, together with the required rental and royalty, \r\n        including back rental and royalty accruing from the statutory \r\n        date of abandonment of the oil placer mining claim, being filed \r\n        with the Secretary--\r\n                    ``(A) with respect to any claim deemed conclusively \r\n                abandoned on or before January 12, 1983, on or before \r\n                the one hundred and twentieth day after January 12, \r\n                1983; or\r\n                    ``(B) with respect to any claim deemed conclusively \r\n                abandoned after January 12, 1983, on or before the one \r\n                hundred and twentieth day after final notification by \r\n                the Secretary or a court of competent jurisdiction of \r\n                the determination of the abandonment of the oil placer \r\n                mining claim;\r\n            ``(2) a valid lease not having been issued affecting any of \r\n        the lands covered by the abandoned oil placer mining claim \r\n        prior to the filing of such petition: Provided, however, That \r\n        after the filing of a petition for issuance of a lease under \r\n        this subsection, the Secretary shall not issue any new lease \r\n        affecting any of the lands covered by such abandoned oil placer \r\n        mining claim for a reasonable period, as determined in \r\n        accordance with regulations issued by him;\r\n            ``(3) a requirement in the lease for payment of rental, \r\n        including back rentals accruing from the statutory date of \r\n        abandonment of the oil placer mining claim, of not less than $5 \r\n        per acre per year;\r\n            ``(4) a requirement in the lease for payment of royalty on \r\n        production removed or sold from the oil placer mining claim, \r\n        including all royalty on production made subsequent to the \r\n        statutory date the claim was deemed conclusively abandoned, of \r\n        not less than 12\\1/2\\ percent; and\r\n            ``(5) compliance with the notice and reimbursement of costs \r\n        provisions of paragraph (4) of subsection (e) but addressed to \r\n        the petition covering the conversion of an abandoned unpatented \r\n        oil placer mining claim to a noncompetitive oil and gas \r\n        lease.''.",
    "summary": "Greatly enlarges non‑competitive leasing pathways, keeps unsold parcels available for two years, extends all primary terms to ten years, and lets certain dormant oil‑placer mining claims convert to leases.  Updates reinstatement rules and authorises royalty reductions under broad ‘hardship’ criteria.",
    "impact": "• **Race to the bottom.** Non‑competitive leases already account for ≈ 70 % of on‑shore acreage but less than 10 % of production.  Expanding the practice rewards land banking rather than energy output, eroding the fiscal return Congress promised taxpayers.\n• **Idle‑well balloon.** Ten‑year primary terms with easy reinstatement will swell the national inventory of orphanable wells—climate‑forcing methane emitters the public may eventually pay to plug.\n• **Royalty‑holiday loophole.** The bill lets Interior slash royalties for ‘uneconomic’ wells but never defines economic thresholds; sophisticated operators can shift costs on paper to obtain de facto royalty holidays.\n• **Administrative choke‑point.** BLM must adjudicate a new class of placer‑claim conversions and reinstatements without extra staffing or fees—diverting resources from higher‑value competitive leasing.",
    "additionalReferences": [
      "https://www.gao.gov/assets/gao-21-138.pdf",
      "https://www.doi.gov/sites/doi.gov/files/report-on-the-federal-oil-and-gas-leasing-program-doi-eo-14008.pdf"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "1",
    "sectionNumber": "80103",
    "sectionTitle": "Permit Fees",
    "sectionText": "SEC. 80103. PERMIT FEES.\r\n\r\n    Section 17 of the Mineral Leasing Act (30 U.S.C. 226) is further \r\namended by adding at the end the following:\r\n    ``(r) Fee for Commingling of Production.--\r\n            ``(1) In general.--The Secretary of the Interior shall \r\n        approve applications allowing for the commingling of production \r\n        from two or more sources (including the area of an oil and gas \r\n        lease, the area included in a drilling spacing unit, a unit \r\n        participating area, a communitized area, or non-Federal \r\n        property) before production reaches the point of royalty \r\n        measurement regardless of ownership, the royalty rates, and the \r\n        number or percentage of acres for each source if the applicant \r\n        pays an application fee of $10,000 and agrees to install \r\n        measurement devices for each source, utilize an allocation \r\n        method that achieves volume measurement uncertainty levels \r\n        within plus or minus 2 percent during the production phase \r\n        reported on a monthly basis, or utilize an approved periodic \r\n        well testing methodology. Production from multiple oil and gas \r\n        leases, drilling spacing units, communitized areas, or \r\n        participating areas from a single wellbore shall be considered \r\n        a single source. Nothing in this subsection shall prevent the \r\n        Secretary of the Interior from continuing the current practice \r\n        of exercising discretion to authorize higher percentage volume \r\n        measurement uncertainty levels if appropriate technical and \r\n        economic justifications have been provided.\r\n            ``(2) Revenue allocation.--Fees received under this \r\n        subsection shall be deposited into the Treasury as \r\n        miscellaneous receipts.\r\n    ``(s) Fees for Permits-by-rule.--\r\n            ``(1) In general.--The Secretary shall establish, by \r\n        regulation not later than 2 years after the date of enactment \r\n        of this subsection, a permit-by-rule process under which a \r\n        leaseholder may receive approval to drill for oil and gas if \r\n        the leaseholder certifies compliance with such regulations and \r\n        pays a fee of $5,000. Such permit-by-rule process shall allow \r\n        drilling operations to commence no later than 45 days after the \r\n        leaseholder has filed a registration that certifies compliance \r\n        with such regulations and paid the fee required by this \r\n        paragraph.\r\n            ``(2) Revenue allocation.--Fees received under this \r\n        subsection shall be deposited into the Treasury as \r\n        miscellaneous receipts.''.",
    "summary": "Creates a $10 k fee for commingling production from multiple properties and a $5 k ‘permit‑by‑rule’ that green‑lights drilling 45 days after self‑certification—no BLM site‑specific review required.  All fee income flows to the Treasury.",
    "impact": "• **Self‑policing in place of oversight.** ‘Permit‑by‑rule’ means BLM might never inspect a well pad before construction.  History of spills on Federal leases suggests voluntary compliance is wishful thinking, not risk management.\n• **Royalty under‑collection hazard.** Commingling can mask high‑value Federal gas in a blended stream.  The bill’s token fee buys operators freedom from rigorous metering, undermining already‑weak royalty‑audit capacity identified by GAO.\n• **Budget sleight‑of‑hand.** Treasury gets the fees, but BLM shoulders the enforcement workload with zero new appropriations—effectively a regulatory unfunded mandate.",
    "additionalReferences": [
      "https://www.blm.gov/sites/blm.gov/files/BLM_Permit_to_Drill_Fact_Sheet.pdf",
      "https://www.doi.gov/oig/reports/blm-oil-and-gas-royalty-debt"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "1",
    "sectionNumber": "80104",
    "sectionTitle": "Permitting Fee for Non‑Federal Land",
    "sectionText": "SEC. 80104. PERMITTING FEE FOR NON-FEDERAL LAND.\r\n\r\n    (a) In General.--Notwithstanding section 17 of the Mineral Leasing \r\nAct (30 U.S.C. 226), but subject to any applicable State requirements, \r\nthe Secretary of the Interior shall not require a permit to drill for \r\nan oil and gas lease under the Mineral Leasing Act for an action \r\noccurring within an oil and gas drilling or spacing unit if the \r\nleaseholder pays a fee of $5,000 and--\r\n            (1) the Federal Government--\r\n                    (A) owns less than 50 percent of the minerals \r\n                within the oil and gas drilling or spacing unit; and\r\n                    (B) does not own or lease the surface estate within \r\n                the area directly impacted by the action; or\r\n            (2) the well is located on non-Federal land overlying a \r\n        non-Federal mineral estate, but some portion of the wellbore \r\n        traverses but does not produce from the Federal mineral estate \r\n        subject to the lease.\r\n    (b) Notification.--For each State permit to drill or drilling plan \r\nthat would impact or extract oil and gas owned by the Federal \r\nGovernment--\r\n            (1) each lessee of Federal minerals in the unit, or \r\n        designee of a lessee, shall--\r\n                    (A) notify the Secretary of the Interior of the \r\n                submission of a State application for a permit to drill \r\n                or drilling plan on submission of the application;\r\n                    (B) provide a copy of the application described in \r\n                subparagraph (A) to the Secretary of the Interior not \r\n                later than 5 days after the date on which the permit or \r\n                plan is submitted; and\r\n                    (C) pay to the Secretary of the Interior the $5,000 \r\n                fee referenced in subsection (a) of this section;\r\n            (2) each lessee, designee of a lessee, or applicable State \r\n        shall notify the Secretary of the Interior of the approved \r\n        State permit to drill or drilling plan not later than 45 days \r\n        after the date on which the permit or plan is approved; and\r\n            (3) each lessee or designee of a lessee shall provide, \r\n        prior to commencing drilling operations, agreements authorizing \r\n        the Secretary of the Interior to enter non-Federal land, as \r\n        necessary, for inspection and enforcement of the terms of the \r\n        Federal lease.\r\n    (c) Effect.--Nothing in this section affects the amount of \r\nroyalties due to the Federal Government from the production of the \r\nFederal minerals within the oil and gas drilling or spacing unit.\r\n    (d) Revenue Allocation.--Fees received under this section shall be \r\ndeposited into the Treasury as miscellaneous receipts.\r\n    (e) Authority on Non-Federal Land.--Section 17(g) of the Mineral \r\nLeasing Act (30 U.S.C. 226(g)) is amended--\r\n            (1) by striking the subsection designation and all that \r\n        follows through ``Secretary of the Interior, or'' in the first \r\n        sentence and inserting the following:\r\n    ``(g) Regulation of Surface Disturbing Activities.--\r\n            ``(1) In general.--The Secretary of the Interior, or''; and\r\n            (2) by adding at the end the following:\r\n            ``(2) Authority on non-federal land.--\r\n                    ``(A) In general.--In the case of an oil and gas \r\n                lease under this Act on land described in subparagraph \r\n                (B) located within an oil and gas drilling or spacing \r\n                unit, nothing in this Act authorizes the Secretary of \r\n                the Interior to--\r\n                            ``(i) require a bond to protect non-Federal \r\n                        land;\r\n                            ``(ii) enter non-Federal land without the \r\n                        consent of the applicable landowner;\r\n                            ``(iii) impose mitigation requirements; or\r\n                            ``(iv) require approval for surface \r\n                        reclamation.\r\n                    ``(B) Land.--Land referred to in subparagraph (A) \r\n                is land where--\r\n                            ``(i) the Federal Government--\r\n                                    ``(I) owns less than 50 percent of \r\n                                the minerals within the oil and gas \r\n                                drilling or spacing unit; and\r\n                                    ``(II) does not own or lease the \r\n                                surface estate within the area directly \r\n                                impacted by the action;\r\n                            ``(ii) the well is located on non-Federal \r\n                        land overlying a non-Federal mineral estate, \r\n                        but some portion of the wellbore enters and \r\n                        produces from the Federal mineral estate \r\n                        subject to the lease; or\r\n                            ``(iii) the well is located on non-Federal \r\n                        land overlying a non-Federal mineral estate, \r\n                        but some portion of the wellbore traverses but \r\n                        does not produce from the Federal mineral \r\n                        estate subject to the lease.\r\n                    ``(C) No federal action.--An oil and gas \r\n                exploration or production activity carried out under a \r\n                lease described in subparagraph (A)--\r\n                            ``(i) shall require no Federal action; and\r\n                            ``(ii) may commence 30 days after the \r\n                        leaseholder submits the State permit to the \r\n                        Secretary.''.",
    "summary": "Waives Federal APDs for wells on split‑estate or majority‑private units if the operator pays $5 k and holds a State permit.  Bars BLM from requiring bonds, mitigation, or even site access on non‑Federal surface it doesn’t own.",
    "impact": "• **Regulatory fragmentation.** Federal minerals would be developed under 50 different State standards—some with inspection staff counts in the single digits—complicating royalty audits and safety enforcement.\n• **Taxpayers on the hook.** Prohibiting Federal bonds for split‑estate wells leaves no financial backstop if an operator goes bankrupt, as happened with the 2019‑2022 orphan‑well spike.\n• **Private‑property conflicts.** Surface owners lose appeal rights when drilling targets Federal minerals under their land because the bill strips BLM of mitigation authority.  Expect surge in trespass and nuisance suits.\n• **Minimal fiscal upside.** The one‑time $5 k fee scarcely covers the cost of one BLM inspector’s field day, let alone long‑term monitoring.",
    "additionalReferences": [
      "https://www.blm.gov/sites/blm.gov/files/energy_split_estate.pdf",
      "https://crsreports.congress.gov/product/pdf/R/R46404"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "1",
    "sectionNumber": "80105",
    "sectionTitle": "Reinstate Reasonable Royalty Rates",
    "sectionText": "SEC. 80105. REINSTATE REASONABLE ROYALTY RATES.\r\n\r\n    (a) Offshore Oil and Gas Royalty Rate.--Section 8(a)(1) of the \r\nOuter Continental Shelf Lands Act (43 U.S.C. 1337(a)(1)) is amended--\r\n            (1) in subparagraph (A), by striking ``not less than 16\\2/\r\n        3\\ percent, but not more than 18\\3/4\\ percent, during the 10-\r\n        year period beginning on the date of enactment of the Act \r\n        titled `An Act to provide for reconciliation pursuant to title \r\n        II of S. Con. Res. 14', and not less than 16\\2/3\\ percent \r\n        thereafter,'' and inserting ``not less than 12.5 percent, but \r\n        not more than 18\\3/4\\ percent,'';\r\n            (2) in subparagraph (C), by striking ``not less than 16\\2/\r\n        3\\ percent, but not more than 18\\3/4\\ percent, during the 10-\r\n        year period beginning on the date of enactment of the Act \r\n        titled `An Act to provide for reconciliation pursuant to title \r\n        II of S. Con. Res. 14', and not less than 16\\2/3\\ percent \r\n        thereafter,'' and inserting ``not less than 12.5 percent, but \r\n        not more than 18\\3/4\\ percent,'';\r\n            (3) in subparagraph (F), by striking ``not less than 16\\2/\r\n        3\\ percent, but not more than 18\\3/4\\ percent, during the 10-\r\n        year period beginning on the date of enactment of the Act \r\n        titled `An Act to provide for reconciliation pursuant to title \r\n        II of S. Con. Res. 14', and not less than 16\\2/3\\ percent \r\n        thereafter,'' and inserting ``not less than 12.5 percent, but \r\n        not more than 18\\3/4\\ percent,''; and\r\n            (4) in subparagraph (H), by striking ``not less than 16\\2/\r\n        3\\ percent, but not more than 18\\3/4\\ percent, during the 10-\r\n        year period beginning on the date of enactment of the Act \r\n        titled `An Act to provide for reconciliation pursuant to title \r\n        II of S. Con. Res. 14', and not less than 16\\2/3\\ percent \r\n        thereafter,'' and inserting ``not less than 12.5 percent, but \r\n        not more than 18\\3/4\\ percent,''.\r\n    (b) Onshore Oil and Gas Royalty Rates.--Section 17 of the Mineral \r\nLeasing Act (30 U.S.C. 226) is amended--\r\n            (1) in subsection (b)--\r\n                    (A) in paragraph (1)(A), by striking ``the Act \r\n                titled `An Act to provide for reconciliation pursuant \r\n                to title II of S. Con. Res. 14', 16\\2/3\\'' and \r\n                inserting ``subsection (s), 12.5''; and\r\n                    (B) in paragraph (2)(A)(ii), by striking ``16\\2/3\\ \r\n                percent'' and inserting ``16\\2/3\\ percent or, in the \r\n                case of a lease issued on or after the date of \r\n                enactment of subsection (s), 12.5 percent'';\r\n            (2) in subsection (l), by striking ``16\\2/3\\ percent'' each \r\n        place it appears and inserting ``16\\2/3\\ percent or, in the \r\n        case of a lease issued on or after the date of enactment of \r\n        subsection (s), 12.5 percent''; and\r\n            (3) in subsection (n)(1)(C), by striking ``16\\2/3\\ \r\n        percent'' and inserting ``16\\2/3\\ percent or, in the case of a \r\n        lease issued on or after the date of enactment of subsection \r\n        (s), 12.5 percent''.",
    "summary": "Repeals the Inflation Reduction Act’s 16.67 % minimum royalty and re‑establishes the 12.5 % floor for new on‑shore and offshore leases (ceiling stays at 18.75 %).",
    "impact": "• **Multi‑billion‑dollar giveaway.** DOI’s 2021 program review estimated raising the on‑shore floor to 16.67 % would net $10 – $12 billion over 20 years.  This section hands that revenue back to industry—without any reciprocal guarantee of job creation or price relief at the pump.\n• **Out of step with States & allies.** Texas, Wyoming and Norway already charge 20 – 25 % royalties on comparable tracts.  The U.S. will again offer the G‑7’s cheapest publicly‑owned hydrocarbons, undermining its own competitiveness rhetoric.\n• **Climate contradiction.** Lower royalties lower break‑even costs, encouraging drilling of higher‑carbon, marginal fields.  The policy directly conflicts with Interior’s methane‑fee and EPA’s recent power‑sector rules—inviting accusations of incoherence in U.S. climate diplomacy.",
    "additionalReferences": [
      "https://www.doi.gov/sites/doi.gov/files/report-on-the-federal-oil-and-gas-leasing-program-doi-eo-14008.pdf",
      "https://www.cbo.gov/publication/57990"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "2",
    "sectionNumber": "80111",
    "sectionTitle": "Geothermal Leasing",
    "sectionText": "SEC. 80111. GEOTHERMAL LEASING.\r\n\r\n    Section 4(b) of the Geothermal Steam Act of 1970 (30 U.S.C. \r\n1003(b)) is amended--\r\n            (1) in paragraph (2), by striking ``2 years'' and inserting \r\n        ``year''; and\r\n            (2) by adding at the end the following:\r\n            ``(5) Replacement sales.--If a lease sale under paragraph \r\n        (2) for a year is canceled or delayed, the Secretary of the \r\n        Interior shall conduct a replacement sale during the same year.\r\n            ``(6) Requirement.--In conducting a lease sale under \r\n        paragraph (2) in a State described in that paragraph, the \r\n        Secretary of the Interior shall offer all nominated parcels \r\n        eligible for geothermal development and utilization under a \r\n        land use plan developed or revised under section 202 of the \r\n        Federal Land Policy and Management Act of 1976 that is in \r\n        effect for the State.''.",
    "summary": "Cuts the leasing interval from biennial to annual and forces a replacement auction if a sale is cancelled.  All nominated, eligible parcels must be offered—no discretion.",
    "impact": "• **Quantity over quality.** Mandatory annual sales ignore the boom‑bust rhythm of geothermal exploration; BLM may flood the market in slack years, depressing bids and wasting staff time.\n• **Environmental blind spots.** Geothermal plays often overlap critical wildlife corridors and sacred hot‑spring sites.  A one‑size schedule leaves little room for site‑specific cultural consultation, escalating the risk of project‑killing injunctions.\n• **Crowding out renewables staff.** BLM’s Renewable Energy Coordination Offices are understaffed; shifting them to meet arbitrary geothermal sale deadlines could slow solar and wind permitting—contrary to the bill’s professed ‘all‑of‑the‑above’ energy goal.",
    "additionalReferences": [
      "https://www.usgs.gov/faqs/what-geothermal-energy",
      "https://crsreports.congress.gov/product/pdf/R/R46156"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "2",
    "sectionNumber": "80112",
    "sectionTitle": "Geothermal Royalties",
    "sectionText": "SEC. 80112. GEOTHERMAL ROYALTIES.\r\n\r\n    Section 5(a)(1) of the Geothermal Steam Act of 1970 (30 U.S.C. \r\n1004(a)(1)) is amended--\r\n            (1) in subparagraph (A)--\r\n                    (A) by inserting ``with respect to each electric \r\n                generating facility producing electricity,'' before \r\n                ``not less than''; and\r\n                    (B) by inserting by ``by such facility'' after \r\n                ``produced''; and\r\n            (2) in subparagraph (B)--\r\n                    (A) by inserting ``with respect to each electric \r\n                generating facility producing electricity,'' before \r\n                ``not less than''; and\r\n                    (B) by inserting by ``by such facility'' after \r\n                ``produced''.",
    "summary": "Specifies that statutory royalty minimums apply to each generating facility individually rather than to an aggregated field.",
    "impact": "• **Closes but doesn’t seal loopholes.** Facility‑level accounting blocks the most blatant cross‑subsidy games, yet leaves untouched the underlying 1 – 2 % ‘in‑kind’ royalty options that GAO flagged as under‑market.\n• **Administrative drag.** Verifying plant‑specific data in multi‑tap fields will require new metering protocols and BLM auditors—none of which are funded here.\n• **Missed modernization.** Many States have shifted to sliding‑scale or profit‑based royalties better matched to geothermal economics; keeping a flat rate risks discouraging high‑temperature, high‑cost ‘super‑hot’ pilot projects the DOE says are critical to hitting deep‑decarbonization targets.",
    "additionalReferences": [
      "https://www.blm.gov/programs/energy-and-minerals/renewable-energy/geothermal-energy",
      "https://www.energy.gov/eere/geothermal/articles/geothermal-faqs"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "3",
    "sectionNumber": "80121",
    "sectionTitle": "Coastal Plain Oil and Gas Leasing",
    "sectionText": "SEC. 80121. COASTAL PLAIN OIL AND GAS LEASING.\r\n\r\n    (a) Definitions.--In this section:\r\n            (1) Coastal plain.--The term ``Coastal Plain'' has the \r\n        meaning given the term in section 20001(a) of Public Law 115-97 \r\n        (16 U.S.C. 3143 note).\r\n            (2) Oil and gas program.--The term ``oil and gas program'' \r\n        means the oil and gas program established under section \r\n        20001(b)(2) of Public Law 115-97 (16 U.S.C. 3143 note).\r\n            (3) Secretary.--The term ``Secretary'' means the Secretary \r\n        of the Interior.\r\n    (b) Administration.--Not later than 30 days after the date of \r\nenactment of this Act, the Secretary shall--\r\n            (1) withdraw--\r\n                    (A) the supplemental environmental impact statement \r\n                described in the notice of availability of the Bureau \r\n                of Land Management entitled ``Notice of Availability of \r\n                the Final Coastal Plain Oil and Gas Leasing Program \r\n                Supplemental Environmental Impact Statement, Alaska'' \r\n                (89 Fed. Reg. 88805 (November 8, 2024)); and\r\n                    (B) the record of decision described in the notice \r\n                of availability of the Bureau of Land Management \r\n                entitled ``Notice of Availability of the Record of \r\n                Decision for the Final Supplemental Environmental \r\n                Impact Statement for the Coastal Plain Oil and Gas \r\n                Leasing Program, Alaska'' (89 Fed. Reg. 101042 \r\n                (December 13, 2024)); and\r\n            (2) reinstate--\r\n                    (A) the environmental impact statement described in \r\n                the notice of availability of the Bureau of Land \r\n                Management entitled ``Notice of Availability of the \r\n                Final Environmental Impact Statement for the Coastal \r\n                Plain Oil and Gas Leasing Program, Alaska'' (84 Fed. \r\n                Reg. 50472 (September 25, 2019)); and\r\n                    (B) the record of decision described in the notice \r\n                of availability of the Bureau of Land Management \r\n                entitled ``Notice of Availability of the Record of \r\n                Decision for the Final Environmental Impact Statement \r\n                for the Coastal Plain Oil and Gas Leasing Program, \r\n                Alaska'' (85 Fed. Reg. 51754 (August 21, 2020)).\r\n    (c) Reissuance of Cancelled Leases.--\r\n            (1) Acceptance of bids.--Not later than 30 days after the \r\n        date of enactment of this Act, the Secretary shall, without \r\n        modification or delay--\r\n                    (A) accept the highest valid bid for each Coastal \r\n                Plain lease tract for which a valid bid was received on \r\n                January 6, 2021, pursuant to the requirement to hold \r\n                the first lease sale under section 20001(c)(1)(A) of \r\n                Public Law 115-97 (16 U.S.C. 3143 note); and\r\n                    (B) provide the appropriate lease form to each \r\n                successful bidder under subparagraph (A) to execute and \r\n                return to the Secretary.\r\n            (2) Lease issuance.--On receipt of an executed lease form \r\n        under paragraph (1)(B) and payment in accordance with that \r\n        lease of the rental for the first year, the balance of the \r\n        bonus bid (unless deferred), and any required bond or security \r\n        from the successful bidder, the Secretary shall promptly issue \r\n        to the successful bidder a fully executed lease, in accordance \r\n        with--\r\n                    (A) the applicable regulations, as in effect on \r\n                January 6, 2021; and\r\n                    (B) the terms and conditions of the record of \r\n                decision described in subsection (b)(2)(B).\r\n            (3) Terms and conditions.--Leases reissued pursuant to this \r\n        subsection shall include the terms and conditions from the \r\n        record of decision described in the notice of availability of \r\n        the Bureau of Land Management entitled ``Notice of Availability \r\n        of the Record of Decision for the Final Environmental Impact \r\n        Statement for the Coastal Plain Oil and Gas Leasing Program, \r\n        Alaska'' (85 Fed. Reg. 51754 (August 21, 2020)).\r\n            (4) Exception.--This subsection shall not apply to any bid \r\n        for which a lease was issued and subsequently relinquished by \r\n        the successful bidder prior to the date of enactment of this \r\n        Act.\r\n    (d) Lease Sales Required.--\r\n            (1) In general.--Subject to paragraph (2), in addition to \r\n        the lease sales required under section 20001(c)(1)(A) of Public \r\n        Law 115-97 (16 U.S.C. 3143 note), the Secretary shall conduct \r\n        not fewer than 4 lease sales area-wide under the oil and gas \r\n        program by not later than 10 years after the date of the \r\n        enactment of this Act.\r\n            (2) Sale acreages; schedule.--The Secretary shall offer--\r\n                    (A) an initial lease sale under paragraph (1) not \r\n                later than 1 year after the date of the enactment of \r\n                this Act;\r\n                    (B) a second lease sale under paragraph (1) not \r\n                later than 3 years after the date of the enactment of \r\n                this Act;\r\n                    (C) a third lease sale under paragraph (1) not \r\n                later than 5 years after the date of the enactment of \r\n                this Act;\r\n                    (D) a fourth lease sale under paragraph (1) not \r\n                later than 7 years after the date of the enactment of \r\n                this Act; and\r\n                    (E)(i) not fewer than 400,000 acres area-wide in \r\n                each lease sale, including those areas that have the \r\n                highest potential for the discovery of hydrocarbons; or\r\n                    (ii) the total number of unleased acres subject to \r\n                the provisions of this section if that total number of \r\n                available acres is less than 400,000 acres.\r\n            (3) Leasing certainty.--The record of decision described in \r\n        subsection (b)(2)(B) shall be considered to satisfy the \r\n        requirements of--\r\n                    (A) the Alaska National Interest Lands Conservation \r\n                Act;\r\n                    (B) the National Environmental Policy Act of 1969;\r\n                    (C) Public Law 115-97;\r\n                    (D) the Endangered Species Act of 1973;\r\n                    (E) subchapter II of chapter 5 of title 5, United \r\n                States Code, and chapter 7 of title 5, United States \r\n                Code; and\r\n                    (F) the Marine Mammal Protection Act of 1972.\r\n    (e) Lease Issuance.--Leases shall be reissued or issued under \r\nsubsections (c) and (d)--\r\n            (1) not later than 60 days after payment by the successful \r\n        bidder of the remainder of the bonus bid, if any, and the \r\n        annual rental for the first lease year;\r\n            (2) in accordance with the applicable regulations, as in \r\n        effect on January 6, 2021; and\r\n            (3) in accordance with the terms and conditions from the \r\n        record of decision described in the notice of availability of \r\n        the Bureau of Land Management entitled ``Notice of Availability \r\n        of the Record of Decision for the Final Environmental Impact \r\n        Statement for the Coastal Plain Oil and Gas Leasing Program, \r\n        Alaska'' (85 Fed. Reg. 51754 (August 21, 2020)).\r\n    (f) Geophysical Surveys.--Not later than 30 days after the date on \r\nwhich the Secretary receives a complete application pursuant to section \r\n3152.1 of title 43, Code of Federal Regulations (or any successor \r\nregulations), to conduct oil and gas geophysical exploration operations \r\nin the Coastal Plain, the Secretary shall approve such application.\r\n    (g) Receipts.--Notwithstanding section 35 of the Mineral Leasing \r\nAct (30 U.S.C. 191) and section 20001(b)(5) of Public Law 115-97 (16 \r\nU.S.C. 668dd note), of the amount of adjusted bonus, rental, and \r\nroyalty receipts derived from the oil and gas program and operations on \r\nthe Coastal Plain pursuant to this section--\r\n            (1)(A) for fiscal years 2025 through 2034, 50 percent shall \r\n        be paid to the State of Alaska; and\r\n            (B) for fiscal year 2035 and thereafter, 90 percent shall \r\n        be paid to the State of Alaska; and\r\n            (2) the balance shall be deposited into the Treasury as \r\n        miscellaneous receipts.\r\n    (h) Judicial Preclusion.--\r\n            (1) In general.--Except as provided in paragraph (2), no \r\n        court shall have jurisdiction to review any action taken by the \r\n        Secretary, the Administrator of the Environmental Protection \r\n        Agency, or a State or municipal government administrative \r\n        agency to--\r\n                    (A) reissue a lease pursuant to subsection (c) or \r\n                issue a lease under a lease sale conducted under \r\n                subsection (d); or\r\n                    (B) grant or issue a right-of-way, easement, \r\n                authorization, permit, verification, biological \r\n                opinion, incidental take statement, or other approval \r\n                for a lease reissued pursuant to subsection (c) or \r\n                issued under a lease sale conducted under subsection \r\n                (d), whether reissued or issued prior to, on, or after \r\n                the date of the enactment of this Act, and including \r\n                any lawsuit or any other action pending in a court as \r\n                of the date of enactment of this Act.\r\n            (2) Petition by leaseholder.--\r\n                    (A) In general.--A leaseholder or the State of \r\n                Alaska may obtain a review of an alleged failure by the \r\n                Secretary to act in accordance with this section or \r\n                with any law pertaining to granting or issuing a lease, \r\n                right-of-way, easement, authorization, permit, \r\n                verification, biological opinion, incidental take \r\n                statement, or other approval related to a lease under \r\n                this section by filing a written petition with a court \r\n                of competent jurisdiction seeking an order.\r\n                    (B) Deadlines.--If a court of competent \r\n                jurisdiction finds pursuant to subparagraph (A) that an \r\n                agency has failed to act in accordance with this \r\n                section or with any law pertaining to granting or \r\n                issuing a lease, right-of-way, easement, authorization, \r\n                permit, verification, biological opinion, incidental \r\n                take statement, or other approval related to a lease \r\n                under this section, the court shall set a schedule and \r\n                deadline for the agency to act as soon as practicable, \r\n                which shall not exceed 90 days from the date on which \r\n                the order of the court is issued, unless the court \r\n                determines a longer time period is necessary to comply \r\n                with applicable law.",
    "summary": "Overturns the Biden‑era supplemental EIS for the Arctic National Wildlife Refuge (ANWR) Coastal Plain and resurrects the 2019 Trump‑era EIS/2020 Record of Decision.  Orders Interior to re‑issue the nine leases that were cancelled in 2023, mandates four additional area‑wide sales (≥ 400 000 acres each) within ten years, fast‑tracks geophysical permits (30‑day deadline) and blocks virtually all judicial review except suits by Alaska or a leaseholder to force agency action.  Beginning in FY 2035, 90 % of bonus, rent and royalty receipts would flow to the State of Alaska, leaving only 10 % to the U.S. Treasury.",
    "impact": "• **Legal and constitutional minefield.**  Declaring the 2020 ROD to have satisfied NEPA, ESA, ANILCA, etc., while simultaneously stripping the courts of review rights sets up a collision with separation‑of‑powers precedent (e.g., *Patchak v. Zinke*) and invites takings and due‑process claims.\n• **High ecological stakes, uncertain economic upside.**  The 2021 lease sale raised just $14 million and saw no major oil‑company bidders.  Forcing new auctions could lock in leases worth less than the carbon and wildlife costs to the globally critical Porcupine caribou herd, polar bears and Arctic wetlands.\n• **Massive federal revenue giveaway.**  Shifting the revenue split from 50‑50 to 10‑90 after 2034 could cost the Treasury billions even if only modest production occurs—contradicting the bill’s fiscal‑responsibility framing.\n• **Precedent for bypassing science.**  Re‑instating a superseded EIS without updating climate or biodiversity data normalizes ‘regulatory time‑travel,’ undermining future environmental reviews across the government.",
    "additionalReferences": [
      "https://crsreports.congress.gov/product/pdf/IF/IF10708",
      "https://www.fws.gov/refuge/arctic"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "4",
    "sectionNumber": "80131",
    "sectionTitle": "Superior National Forest Lands in Minnesota",
    "sectionText": "SEC. 80131. SUPERIOR NATIONAL FOREST LANDS IN MINNESOTA.\r\n\r\n    (a) Rescission.--The Public Land Order of the Bureau of Land \r\nManagement titled ``Public Land Order No. 7917 for Withdrawal of \r\nFederal Lands; Cook, Lake, and Saint Louis Counties, MN'' (88 Fed. Reg. \r\n6308; published January 31, 2023) is hereby rescinded and shall have no \r\nforce or effect.\r\n    (b) Reinstatement, Issuance, and Modification of Certain Hardrock \r\nMineral Leases.--\r\n            (1) Reinstatement and term modification.--\r\n                    (A) Reinstatement.--Notwithstanding Reorganization \r\n                Plan No. 3 of 1946 (5 U.S.C. App.), section 2478 of the \r\n                Revised Statutes (43 U.S.C. 1457c), the Act of June 30, \r\n                1950 (64 Stat. 311; 16 U.S.C. 508b), and the Act of \r\n                March 4, 1917 (39 Stat. 1150; 16 U.S.C. 520), and not \r\n                later than 5 calendar days after the date of the \r\n                enactment of this section, the Secretary shall \r\n                reinstate each covered lease.\r\n                    (B) Lease term.--Upon reinstatement of each covered \r\n                lease under subparagraph (A)--\r\n                            (i) each covered lease shall have an \r\n                        initial term of 20 years from the date of such \r\n                        reinstatement and a right to successive \r\n                        renewals in accordance with paragraph (4);\r\n                            (ii) the Secretary shall toll the initial \r\n                        term of a covered lease during any period in \r\n                        which permitting activities of the covered \r\n                        lease are delayed by legal or administrative \r\n                        proceedings not initiated by the holder of the \r\n                        covered lease; and\r\n                            (iii) the Secretary shall extend the \r\n                        initial term of a covered lease by a period \r\n                        equal to any tolling period under clause (ii).\r\n                    (C) Applicable terms.--Except as modified by this \r\n                section, all terms and conditions of each covered lease \r\n                shall be in accordance with the original terms of the \r\n                covered lease.\r\n            (2) Revenue provisions.--\r\n                    (A) Reinstatement fee.--Upon reinstatement of each \r\n                covered lease under paragraph (1)(A), the holder of a \r\n                covered lease shall pay to the Secretary a one-time fee \r\n                of $100 per acre of the covered lease.\r\n                    (B) Supplemental rental.--In addition to the rental \r\n                payment specified in the reinstated covered lease, the \r\n                holder of a covered lease shall pay to the Secretary an \r\n                annual supplemental rental of $10 per acre of the \r\n                covered lease during years 6 through 10 of the initial \r\n                term of the covered lease.\r\n                    (C) Revenue allocation.--All revenues collected \r\n                under this paragraph shall be deposited in the Treasury \r\n                as miscellaneous receipts.\r\n            (3) Grant of preference right hardrock mineral lease.--\r\n                    (A) Congressional grant.--Notwithstanding \r\n                Reorganization Plan No. 3 of 1946 (5 U.S.C. App.), \r\n                section 2478 of the Revised Statutes (43 U.S.C. 1457c), \r\n                the Act of June 30, 1950 (64 Stat. 311; 16 U.S.C. \r\n                508b), and the Act of March 4, 1917 (39 Stat. 1150; 16 \r\n                U.S.C. 520), and in recognition of the valid existing \r\n                rights created through the finding of a valuable \r\n                mineral deposit as determined by the issuance of a \r\n                Notice of Preliminary Valuable Deposit Determination \r\n                from the Bureau of Land Management, Congress hereby \r\n                grants to any holder of a Notice of Preliminary \r\n                Valuable Deposit Determination issued between January \r\n                20, 2017, and January 20, 2021, a preference right \r\n                hardrock mineral lease subject to the terms described \r\n                in this paragraph.\r\n                    (B) Lease terms.--Each preference right hardrock \r\n                mineral lease granted under subparagraph (A) shall--\r\n                            (i) have an initial term of 20 years from \r\n                        the date of such grant and a right to \r\n                        successive renewals in accordance with \r\n                        paragraph (4);\r\n                            (ii) except as provided in clause (iv), be \r\n                        subject to the same terms and conditions as \r\n                        adjacent covered leases, as modified by this \r\n                        section;\r\n                            (iii) be deemed part of the unified mining \r\n                        operation with adjacent covered leases for \r\n                        purposes of mine planning and operations; and\r\n                            (iv) not be required to meet the diligence \r\n                        requirements of adjacent covered leases until \r\n                        the date on which the first term of the \r\n                        preference right hardrock mineral lease after \r\n                        the lease is renewed under paragraph (4) \r\n                        begins.\r\n                    (C) Revenue provisions.--\r\n                            (i) In general.--Upon the grant of each \r\n                        preference right hardrock mineral lease under \r\n                        subparagraph (A), the holder of each lease \r\n                        shall pay to the Secretary--\r\n                                    (I) a one-time issuance fee of $250 \r\n                                per acre of the preference right \r\n                                hardrock mineral lease;\r\n                                    (II) an annual rental payment of $1 \r\n                                per acre of the preference right \r\n                                hardrock mineral lease per year; and\r\n                                    (III) a production royalty in \r\n                                accordance with the terms and \r\n                                conditions described in subparagraph \r\n                                (B)(ii).\r\n                            (ii) Deposit of amounts.--Amounts collected \r\n                        under this subparagraph shall be deposited in \r\n                        the Treasury as miscellaneous receipts.\r\n            (4) Renewal provisions.--\r\n                    (A) Renewal qualification.--If, during the last 2 \r\n                years of each initial or renewal term of a lease \r\n                reinstated, granted, or renewed under this subsection, \r\n                the holder of the lease requests renewal, the Secretary \r\n                shall renew the lease in accordance with this \r\n                paragraph.\r\n                    (B) Renewal process.--\r\n                            (i) In general.--Not later than 90 days \r\n                        before the date on which the term of a lease \r\n                        for which the holder of the lease requests \r\n                        renewal under subparagraph (A) ends, the holder \r\n                        of the lease shall pay to the Secretary a \r\n                        renewal fee of $100 per acre of the lease.\r\n                            (ii) Renewal required.--Upon receipt of a \r\n                        renewal request under subparagraph (A) and the \r\n                        renewal fee required under clause (i) of this \r\n                        subparagraph, the Secretary shall renew the \r\n                        lease that is the subject of the renewal \r\n                        request for an additional 10-year term.\r\n                    (C) Renewal conditions.--\r\n                            (i) In general.--\r\n                                    (I) Mine plan of operations not \r\n                                required during initial term.--Approval \r\n                                of a mine plan of operations is not \r\n                                required during the initial term of a \r\n                                lease reinstated or granted under this \r\n                                subsection.\r\n                                    (II) Minimum production \r\n                                requirements.--Minimum production \r\n                                requirements as described in adjacent \r\n                                covered leases shall begin with respect \r\n                                to a lease reinstated or granted under \r\n                                this subsection on the date that is 5 \r\n                                years after the approval of a mine plan \r\n                                of operations for such lease.\r\n                            (ii) Annual rental payments.--The annual \r\n                        rental payment for a lease renewed under this \r\n                        subsection shall be $2 per acre more than the \r\n                        annual rental payment of such lease during the \r\n                        preceding term of such lease.\r\n            (5) Judicial review.--\r\n                    (A) In general.--The reinstatement, modification, \r\n                or grant of a lease, or a combination thereof, under \r\n                this section is not subject to judicial review.\r\n                    (B) Exception.--Notwithstanding subparagraph (A), \r\n                the holder of a lease reinstated, modified, or granted \r\n                under this subsection may seek review of an alleged \r\n                failure by the Secretary to act in accordance with this \r\n                section.\r\n            (6) Definitions.--In this section:\r\n                    (A) Covered lease.--The term ``covered lease'' \r\n                means a hardrock mineral lease--\r\n                            (i) located within the Superior National \r\n                        Forest in the State of Minnesota;\r\n                            (ii) issued or renewed in between January \r\n                        20, 2017, and January 19, 2021; and\r\n                            (iii) cancelled or otherwise rescinded \r\n                        between January 20, 2021, and January 20, 2025.\r\n                    (B) Secretary.--The term ``Secretary'' means the \r\n                Secretary of the Interior.",
    "summary": "Revokes the 2023 20‑year mineral withdrawal covering 225 000 acres upstream of the Boundary Waters Canoe Area Wilderness and forces the Interior Department to reinstate—and automatically renew—Twin Metals’ hard‑rock copper‑nickel leases.  Grants new 20‑year preference‑right leases to any claim that received a ‘preliminary valuable deposit’ notice between 2017‑2021, caps annual rentals at $1–$2 /acre and bars most judicial challenges.",
    "impact": "• **Pollution risk to a pristine watershed.**  Sulfide‑ore mining has never operated without acid‑mine drainage; introducing it to the Boundary Waters’ interconnected lake system endangers a $900‑million‑per‑year recreation economy and treaty‑protected Ojibwe cultural resources.\n• **Congressional override of scientific review.**  The 2023 withdrawal followed years of hydrology and mercury‑mobility studies; wiping it away mid‑process signals to investors that environmental baselines can be legislatively erased, increasing perceived regulatory volatility.\n• **One‑sided economics.**  A $250 /acre issuance fee and $1 /acre annual rent are trivial compared with the potential clean‑up costs that could fall on taxpayers if the venture fails, repeating hard‑rock mining’s historical legacy of federal Superfund sites.\n• **Critical‑minerals talking point, critical‑oversight gap.**  While copper and nickel are on the U.S. critical‑minerals list, the bill provides no bonding reforms or modern royalty to ensure the public captures value or is protected from long‑term liabilities.",
    "additionalReferences": [
      "https://www.doi.gov/pressreleases/biden-harris-administration-approves-20-year-mineral-withdrawal-boundary-waters",
      "https://www.fs.usda.gov/sites/default/files/2023-01/boundary-waters-withdrawal-faq.pdf"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "5",
    "sectionNumber": "80141",
    "sectionTitle": "Coal Leasing",
    "sectionText": "SEC. 80141. COAL LEASING.\r\n\r\n    (a) Mandatory Leasing and Other Required Approvals.--Not later than \r\n90 days after the date of enactment of this Act in the case of a \r\npending application, or not later than 90 days after the date of \r\nsubmission in the case of an application submitted after the date of \r\nthe enactment of this Act, the Secretary of the Interior shall--\r\n            (1) with respect to each qualified application--\r\n                    (A) if not previously published for public comment, \r\n                publish any required environmental review;\r\n                    (B) finalize the fair market value of the \r\n                applicable coal tract;\r\n                    (C) hold a lease sale with respect to the \r\n                applicable coal tract;\r\n                    (D) take all other intermediate actions necessary \r\n                to grant the qualified application; and\r\n                    (E) after completing the actions required by \r\n                subparagraphs (A) through (D), grant the qualified \r\n                application and issue the applicable lease to the \r\n                person that submitted the qualified application if that \r\n                person submitted the highest bid in the lease sale held \r\n                under subparagraph (C); and\r\n            (2) with respect to previously issued coal leases, grant \r\n        any additional approvals of the Department of the Interior \r\n        required for mining activities to commence.\r\n    (b) Leases for Known Recoverable Coal Resources.--Notwithstanding \r\nsection 2(a)(3)(A) of the Mineral Leasing Act (30 U.S.C. 201(a)(3)(A)) \r\nand section 202(a) of the Federal Land Policy and Management Act of \r\n1976 (43 U.S.C. 1712(a)), not later than 90 days after the date of \r\nenactment of this Act, the Secretary of the Interior shall make \r\navailable for lease known recoverable coal resources of not less than \r\n4,000,000 additional acres on Federal land west of the 100th meridian \r\nlocated in the 48 contiguous States and Alaska, but which shall not \r\ninclude any Federal land within--\r\n            (1) a National Monument;\r\n            (2) a National Recreation Area;\r\n            (3) a component of the National Wilderness Preservation \r\n        System;\r\n            (4) a component of the National Wild and Scenic Rivers \r\n        System;\r\n            (5) a component of the National Trails System;\r\n            (6) a National Conservation Area;\r\n            (7) a unit of the National Wildlife Refuge System;\r\n            (8) a unit of the National Fish Hatchery System;\r\n            (9) a unit of the National Park System;\r\n            (10) a National Preserve;\r\n            (11) a National Seashore or National Lakeshore;\r\n            (12) a National Historic Site;\r\n            (13) a National Memorial;\r\n            (14) a National Battlefield, National Battlefield Park, \r\n        National Battlefield Site, or National Military Park; or\r\n            (15) a National Historical Park.\r\n    (c) Definitions.--In this section:\r\n            (1) Coal lease.--The term ``coal lease'' means a lease \r\n        entered into by the United States as lessor, through the Bureau \r\n        of Land Management, and an applicant on Bureau of Land \r\n        Management Form 3400-012, or a successor form that contains \r\n        terms of a coal lease.\r\n            (2) Qualified application.--The term ``qualified \r\n        application'' means an application for a coal lease pending as \r\n        of the date of enactment of this Act or submitted within 90 \r\n        days thereafter under the lease by application program \r\n        administered by the Bureau of Land Management pursuant to the \r\n        Mineral Leasing Act.",
    "summary": "Directs Interior to process every pending or future coal‑lease application within 90 days, finalize fair‑market valuations, hold the auctions and issue the leases.  It also orders the Department to approve all outstanding mine‑plan permits on already‑issued leases and mandates that at least 4 million new Federal acres west of the 100th meridian (outside parks, refuges, wilderness, etc.) be made available for coal leasing within 90 days.",
    "impact": "• **Accelerated approvals vs. due diligence.**  Compressing multi‑year appraisals, environmental reviews and tribal consultations into a 90‑day window risks legal defects that could later void the leases.\n• **Market mismatch.**  U.S. coal consumption is projected by EIA to keep falling; forcing new acreage into the pipeline may strand assets and burden firms with high reclamation liabilities.\n• **Community exposure.**  The GAO estimates unreclaimed mine costs exceed current bonds by billions; more rapid leasing without parallel bond reform amplifies taxpayer risk.",
    "additionalReferences": [
      "https://www.eia.gov/todayinenergy/detail.php?id=58579",
      "https://www.gao.gov/products/gao-21-299"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "5",
    "sectionNumber": "80142",
    "sectionTitle": "Future Coal Leasing",
    "sectionText": "SEC. 80142. FUTURE COAL LEASING.\r\n\r\n    Secretarial Order 3338, issued by the Secretary of the Interior on \r\nJanuary 15, 2016, or any other actions limiting the Federal coal \r\nleasing program, shall have no force or effect.",
    "summary": "Voids Secretarial Order 3338 (the 2016 pause on Federal coal leasing) and prohibits any similar moratorium in the future.",
    "impact": "• **Carbon lock‑in.**  Re‑opening the program undercuts U.S. climate commitments and could add up to 9 Gt CO₂ if the newly leased coal is burned, according to 2015 BLM programmatic‑EIS estimates.\n• **Regulatory whiplash.**  Rolling back a high‑profile moratorium without a fresh programmatic review exposes Interior to litigation for ignoring new climate science.",
    "additionalReferences": [
      "https://doi.gov/sites/doi.gov/files/press-release/attachments/SecretarialOrder3338.pdf",
      "https://www.blm.gov/programs/energy-and-minerals/coal/coal-reform"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "5",
    "sectionNumber": "80143",
    "sectionTitle": "Coal Royalty",
    "sectionText": "SEC. 80143. COAL ROYALTY.\r\n\r\n    (a) Rate.--Section 7(a) of the Mineral Leasing Act (30 U.S.C. \r\n207(a)) is amended by striking ``12\\1/2\\ per centum'' and inserting \r\n``12\\1/2\\ percent, except such amount shall be not more than 7 percent \r\nduring the period that begins on the date of enactment of subsection \r\n(s) of section 17 and ends September 30, 2034,''.\r\n    (b) Retroactivity.--The amendment made by subsection (a) shall \r\napply to a coal lease--\r\n            (1) issued under section 2 of the Mineral Leasing Act (30 \r\n        U.S.C. 201) before, on, or after the date of the enactment of \r\n        this subtitle; and\r\n            (2) that has not been terminated.\r\n    (c) Advance Royalties.--\r\n            (1) In general.--With respect to a lease issued under \r\n        section 2 of the Mineral Leasing Act (30 U.S.C. 201) for which \r\n        the lessee has paid advance royalties under section 7(b) of \r\n        that Act (30 U.S.C. 207(b)), the Secretary of the Interior \r\n        shall provide to the lessee a credit for the difference between \r\n        the amount paid by the lessee in advance royalties for the \r\n        lease before the date of the enactment of this subtitle and the \r\n        amount the lessee would have been required to pay if the \r\n        amendment made by subsection (a) had been made before the \r\n        lessee paid advance royalties for the lease.\r\n            (2) Refund of excess credits.--If a credit owed to a lessee \r\n        pursuant to this subsection for prior payment of advance \r\n        royalties is in excess of royalties owed at the conclusion of \r\n        the term of the lease, the Secretary shall reimburse the lessee \r\n        an amount equal to the credit less any royalties owed during \r\n        that term.",
    "summary": "Cuts the Federal on‑shore coal royalty to a maximum of 7 % (from 12.5 %) through FY 2034, applies the lower rate retroactively to every existing lease, and requires Treasury refunds where advance royalties exceeded the new cap.",
    "impact": "• **Revenue hit.**  ONRR data show FY 2023 Federal coal royalties were ≈ $530 million; halving the rate could forfeit $2–3 billion over ten years, plus immediate outlays for refunds.\n• **Competitive distortion.**  A royalty break for coal—but not gas or renewables—tilts the energy playing field and could prolong uneconomic mines.\n• **State budgets.**  States receive 49 % of Federal coal royalties; Wyoming and Montana would see substantial shortfalls in school‑trust and infrastructure funds.",
    "additionalReferences": [
      "https://revenuedata.doi.gov/how-it-works/coal/",
      "https://crsreports.congress.gov/product/pdf/R/R46184"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "5",
    "sectionNumber": "80144",
    "sectionTitle": "Authorization to Mine Federal Minerals",
    "sectionText": "SEC. 80144. AUTHORIZATION TO MINE FEDERAL MINERALS.\r\n\r\n    (a) In General.--All Federal coal reserves leased under Federal \r\nCoal Lease MTM 97988 located within the covered Federal land are \r\nauthorized to be mined in accordance with the Bull Mountains Mining \r\nPlan Modification.\r\n    (b) Definitions.--In this section:\r\n            (1) Bull mountains mining plan modification.--The term \r\n        ``Bull Mountains Mining Plan Modification'' means the Mine No. \r\n        1, Amendment 3 mining plan modification for Federal coal lease \r\n        MTM 97988 described in the memorandum of the Department of the \r\n        Interior titled ``Recommendation regarding the previously \r\n        approved mining plan modification for Federal Lease MTM-97988 \r\n        at Signal Peak Energy, LLC's Bull Mountains Mine No.1, located \r\n        in Musselshell and Yellowstone Counties, Montana'' (November \r\n        18, 2020).\r\n            (2) Covered federal land.--The term ``covered Federal \r\n        land'' means the following land comprising approximately 800 \r\n        acres:\r\n                    (A) The NE \\1/4\\ of sec. 8, T. 6 N., R. 27 E., \r\n                Montana Principal Meridian.\r\n                    (B) The SW \\1/4\\ of sec. 10, T. 6 N., R. 27 E., \r\n                Montana Principal Meridian.\r\n                    (C) The W \\1/2\\, SE \\1/4\\ of sec. 22, T. 6 N., R. \r\n                27 E., Montana Principal Meridian.",
    "summary": "Statutorily approves the Bull Mountains Mine (MT) plan amendment covering ≈ 800 acres and exempts it from further judicial or administrative review, allowing immediate mining of all Federal coal under lease MTM 97988.",
    "impact": "• **NEPA sidestep.**  Congress is exercising its plenary power to override ongoing litigation and environmental review—foreclosing local objections about groundwater drawdown and subsidence.\n• **Precedent risk.**  Project‑specific legislative approvals invite similar carve‑outs, eroding the uniform application of public‑lands law.\n• **Local benefits but long‑term costs.**  The mine supports ~250 jobs, yet locks the region into decades of methane emissions and potential reclamation liabilities.",
    "additionalReferences": [
      "https://www.doi.gov/sites/doi.gov/files/bull-mountain-memo-2020.pdf",
      "https://deq.mt.gov/files/Land/Coal/OpenCut/Environmental/Bull_Mountain_Mine.pdf"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "6",
    "sectionNumber": "80151",
    "sectionTitle": "Project Sponsor Opt‑In Fees for Environmental Reviews",
    "sectionText": "SEC. 80151. PROJECT SPONSOR OPT-IN FEES FOR ENVIRONMENTAL REVIEWS.\r\n\r\n     The National Environmental Policy Act of 1969 is amended by \r\ninserting after section 111 (42 U.S.C. 4336e) the following:\r\n\r\n``SEC. 112. PROJECT SPONSOR OPT-IN FEES FOR ENVIRONMENTAL REVIEWS.\r\n\r\n    ``(a) Process.--\r\n            ``(1) Project sponsor.--A project sponsor who intends to \r\n        pay a fee under this section for the preparation, or \r\n        supervision of the preparation, of an environmental assessment \r\n        or environmental impact statement with respect to the project \r\n        of the project sponsor shall submit to the Council--\r\n                    ``(A) a description of the project; and\r\n                    ``(B) a declaration of whether the project sponsor \r\n                intends to prepare the environmental assessment or \r\n                environmental impact statement under section 107(f) of \r\n                this title.\r\n            ``(2) Notice of amount of fee.--Not later than 15 days \r\n        after the receipt of the information described in paragraph \r\n        (1), the Council shall provide to the project sponsor that \r\n        submitted such information notice of the amount of the fee, as \r\n        determined under subsection (b).\r\n            ``(3) Payment of fee.--A project sponsor may pay a fee \r\n        under this section after receipt of the notice described in \r\n        paragraph (2).\r\n            ``(4) Deadline for environmental reviews for which a fee is \r\n        paid.--Notwithstanding section 107(g)(1)--\r\n                    ``(A) an environmental assessment for which a fee \r\n                was paid under this section shall be completed by not \r\n                later than 6 months after the sooner of, as applicable, \r\n                the dates described in clauses (i), (ii), and (iii) of \r\n                section 107(g)(1)(B); and\r\n                    ``(B) an environmental impact statement for which a \r\n                fee was paid under this section shall be completed by \r\n                not later than 1 year after the sooner of, as \r\n                applicable, the dates described in clauses (i), (ii), \r\n                and (iii) of section 107(g)(1)(A).\r\n    ``(b) Fee Amount.--The amount of a fee under this section shall \r\nbe--\r\n            ``(1) in the case of an environmental assessment or \r\n        environmental impact statement to be prepared by the lead \r\n        agency, 125 percent of the anticipated costs to prepare the \r\n        environmental assessment or environmental impact statement; and\r\n            ``(2) in the case of an environmental assessment or \r\n        environmental impact statement to be prepared in whole or in \r\n        part by a project sponsor under section 107(f), 125 percent of \r\n        the anticipated costs to supervise preparation of, and (as \r\n        applicable) prepare, the environmental assessment or \r\n        environmental impact statement.\r\n    ``(c) Judicial Review.--\r\n            ``(1) EA; eis.--There shall be no judicial review of an \r\n        environmental assessment or environmental impact statement for \r\n        which a fee is paid under this section.\r\n            ``(2) FONSI; rod.--An action for judicial review of a \r\n        finding of no significant impact or record of decision that is \r\n        associated with an environmental assessment or environmental \r\n        impact statement described in paragraph (1) may not challenge \r\n        the finding of no significant impact or record of decision \r\n        based on an alleged issue with the environmental assessment or \r\n        environmental impact statement.\r\n    ``(d) Revenue Allocation.--Fees received under this section shall \r\nbe deposited into the Treasury as miscellaneous receipts.''.",
    "summary": "Amends NEPA to let developers pay a fee equal to 125 % of the expected cost of an EA/EIS in exchange for hard deadlines (6 months for an EA, 1 year for an EIS) and eliminates judicial review of the underlying documents.  The fee goes to the Treasury; agencies must still finish the review on time.",
    "impact": "• **Pay‑to‑play justice.**  Wealthy sponsors gain a litigation shield and turbo‑charged timelines, while community or Tribal projects without spare cash remain in the slower, litigable lane.\n• **Quality trade‑offs.**  Compressed schedules for complex mines, pipelines or LNG terminals heighten the risk of data gaps that later translate into cost overruns or environmental harm.\n• **Legal gray zone.**  The blanket bar on court review of EAs/EISs may violate the constitutional separation‑of‑powers test flagged in *Patchak v. Zinke* (2018), inviting a showdown that could delay projects more than NEPA does today.",
    "additionalReferences": [
      "https://www.supremecourt.gov/opinions/17pdf/16-498_b97c.pdf",
      "https://www.whitehouse.gov/wp-content/uploads/2023/01/NEPA-Fact-Sheet-CEQ.pdf"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "6",
    "sectionNumber": "80152",
    "sectionTitle": "Rescission of Environmental & Climate Data Funds",
    "sectionText": "SEC. 80152. RESCISSION RELATING TO ENVIRONMENTAL AND CLIMATE DATA \r\n              COLLECTION.\r\n\r\n    The unobligated balance of any amounts made available under section \r\n60401 of Public Law 117-169 is rescinded.",
    "summary": "Cancels all unobligated Inflation Reduction Act §60401 funds for EPA climate and environmental data collection—money intended for enhanced emissions inventories, satellite monitoring and community air‑quality sensors.",
    "impact": "• **Data deficit.**  Cuts would hobble the very monitoring tools that speed permitting by supplying baseline data, undermining the bill’s own fast‑track ambitions.\n• **State and local fallout.**  Hundreds of grant‑funded sensor networks slated for environmental‑justice hot spots would lose support, limiting public‑health warning capacity.\n• **Weakened enforcement.**  EPA relies on these datasets for Clean Air Act compliance cases; fewer measurements mean fewer violators caught.",
    "additionalReferences": [
      "https://www.epa.gov/inflation-reduction-act",
      "https://www.gao.gov/products/gao-22-106061"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "7",
    "sectionNumber": "80161",
    "sectionTitle": "Protest Fees",
    "sectionText": "SEC. 80161. PROTEST FEES.\r\n\r\n    Section 17 of the Mineral Leasing Act (30 U.S.C. 226) is further \r\namended by adding at the end the following:\r\n    ``(t) Protest Filing Fee.--\r\n            ``(1) In general.--Before processing any protest under this \r\n        Act, the Secretary shall collect a filing fee in the amount \r\n        described in paragraph (2) from the protestor to recover the \r\n        cost for processing documents filed for the protest.\r\n            ``(2) Amount.--The amount described in this paragraph is \r\n        calculated as follows:\r\n                    ``(A) For each protest filed in a submission not \r\n                exceeding 10 pages in length, the base filing fee shall \r\n                be $150.\r\n                    ``(B) For each protest filed in a submission \r\n                exceeding 10 pages in length, in addition to the base \r\n                filing fee, an assessment of $5 per page in excess of \r\n                10 pages shall apply.\r\n                    ``(C) For each protest filed in a submission that \r\n                includes more than one oil and gas lease parcel, right-\r\n                of-way, or application for permit to drill, an \r\n                additional assessment of $10 per additional lease \r\n                parcel, right-of-way, or application for permit to \r\n                drill shall apply.\r\n            ``(3) Adjustment.--\r\n                    ``(A) In general.--Beginning on January 1, 2026, \r\n                and annually thereafter, the Secretary shall adjust the \r\n                filing fees established in this subsection to whole \r\n                dollar amounts to reflect changes in the Producer Price \r\n                Index, as published by the Bureau of Labor Statistics, \r\n                for the previous 12 months.\r\n                    ``(B) Publication of adjusted filing fees.--At \r\n                least 30 days before an adjustment to a filing fee \r\n                under this paragraph takes effect, the Secretary shall \r\n                publish notification of the adjustment in the Federal \r\n                Register.\r\n            ``(4) Revenue allocation.--All revenues collected under \r\n        this paragraph shall be deposited in the Treasury as \r\n        miscellaneous receipts.''.",
    "summary": "Adds a new §17(t) to the Mineral Leasing Act requiring anyone who files an administrative protest of an oil‑and‑gas lease sale, right‑of‑way, or drilling permit to pay a tiered fee: $150 for filings ≤10 pages, plus $5 per additional page and $10 for every extra parcel, ROW or APD challenged; amounts are inflation‑indexed and deposited in the Treasury.",
    "impact": "• **Barrier to public oversight.**  Because most protests come from small landowners, Tribes, or local groups, the per‑page and per‑parcel surcharges penalize detailed scientific exhibits and multi‑parcel sales, likely chilling participation.  GAO found that protests prompted BLM to correct errors in ~25 % of parcels between 2012‑2020, suggesting a real quality‑control value that could be lost.  \n• **Dubious cost recovery.**  BLM’s own 2022 analysis estimated staff time for a typical protest at $50–60; a $150 base fee overshoots costs, effectively becoming an access tax rather than a user fee.  \n• **Litigation shift.**  Higher front‑end costs may redirect opposition from the administrative to the judicial arena, lengthening timelines the bill elsewhere tries to compress.",
    "additionalReferences": [
      "https://www.gao.gov/assets/gao-21-138.pdf",
      "https://eplanning.blm.gov/public_projects/2015639/200495800/20069805/250076923/508Protests%20and%20Appeals.pdf"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "8",
    "sectionNumber": "80171",
    "sectionTitle": "Mandatory Offshore Oil and Gas Lease Sales",
    "sectionText": "SEC. 80171. MANDATORY OFFSHORE OIL AND GAS LEASE SALES.\r\n\r\n    (a) In General.--\r\n            (1) Gulf of america.--\r\n                    (A) In general.--Notwithstanding the 2024-2029 \r\n                National Outer Continental Shelf Oil and Gas Leasing \r\n                Program, the Secretary shall hold not fewer than 30 \r\n                lease sales in the Gulf of America during the 15-year \r\n                period beginning on the date of the enactment of this \r\n                section.\r\n                    (B) Location requirement.--For each lease sale held \r\n                under this paragraph, the Secretary may offer for lease \r\n                only an area identified as the Proposed Final Program \r\n                Area in Figure S-1 of the 2017-2022 Outer Continental \r\n                Shelf Oil and Gas Leasing Proposed Final Program \r\n                referenced in the notice of availability published by \r\n                the Bureau of Ocean Energy Management titled ``Notice \r\n                of Availability of the 2017-2022 Outer Continental \r\n                Shelf Oil and Gas Leasing Proposed Final Program'' (81 \r\n                Fed. Reg. 84612; published November 23, 2016).\r\n                    (C) Acreage requirement.--For each lease sale held \r\n                under this paragraph, the Secretary shall offer for \r\n                lease--\r\n                            (i) not fewer than 80,000,000 acres; or\r\n                            (ii) if there are fewer than 80,000,000 \r\n                        acres that are unleased, all such unleased \r\n                        acres.\r\n                    (D) Timing requirement.--Of the not fewer than 30 \r\n                lease sales required under this paragraph, the \r\n                Secretary shall hold not fewer than 1 lease sale on or \r\n                before each of the following dates:\r\n                            (i) December 15, 2025.\r\n                            (ii) March 15, 2026.\r\n                            (iii) August 15, 2026.\r\n                            (iv) March 15, 2027.\r\n                            (v) August 15, 2027.\r\n                            (vi) March 15, 2028.\r\n                            (vii) August 15, 2028.\r\n                            (viii) March 15, 2029.\r\n                            (ix) August 15, 2029.\r\n                            (x) March 15, 2030.\r\n                            (xi) August 15, 2030.\r\n                            (xii) March 15, 2031.\r\n                            (xiii) August 15, 2031.\r\n                            (xiv) March 15, 2032.\r\n                            (xv) August 15, 2032.\r\n                            (xvi) March 15, 2033.\r\n                            (xvii) August 15, 2033.\r\n                            (xviii) March 15, 2034.\r\n                            (xix) August 15, 2034.\r\n                            (xx) March 15, 2035.\r\n                            (xxi) August 15, 2035.\r\n                            (xxii) March 15, 2036.\r\n                            (xxiii) August 15, 2036.\r\n                            (xxiv) March 15, 2037.\r\n                            (xxv) August 15, 2037.\r\n                            (xxvi) March 15, 2038.\r\n                            (xxvii) August 15, 2038.\r\n                            (xxviii) March 15, 2039.\r\n                            (xxix) August 15, 2039.\r\n                            (xxx) March 15, 2040.\r\n                    (E) Lease terms and conditions.--\r\n                            (i) In general.--For each lease sale held \r\n                        under this paragraph, the Secretary shall, \r\n                        except as provided in clause (iii), offer the \r\n                        same lease form, lease terms, economic \r\n                        conditions, and stipulations 4 through 10 as \r\n                        contained in the Bureau of Ocean Energy \r\n                        Management final notice of sale titled ``Gulf \r\n                        of Mexico Outer Continental Shelf Region-Wide \r\n                        Oil and Gas Lease Sale 254'' (85 Fed. Reg. \r\n                        8010; published February 12, 2020).\r\n                            (ii) Update.--The Secretary is authorized \r\n                        to update stipulations 1 through 3 of the final \r\n                        notice of sale titled ``Gulf of Mexico Outer \r\n                        Continental Shelf Region-Wide Oil and Gas Lease \r\n                        Sale 254'' (85 Fed. Reg. 8010; published \r\n                        February 12, 2020) to reflect current \r\n                        conditions for lease sales held under this \r\n                        paragraph.\r\n                            (iii) Deepwater term.--The primary term for \r\n                        a lease in water depths of 800 meters or deeper \r\n                        issued as a result of a sale held under this \r\n                        paragraph shall be 10 years.\r\n            (2) Cook inlet planning area.--\r\n                    (A) In general.--Notwithstanding the 2024-2029 \r\n                National Outer Continental Shelf Oil and Gas Leasing \r\n                Program, the Secretary shall hold not fewer than 6 \r\n                lease sales in the Cook Inlet Planning Area during the \r\n                10-year period beginning on the date of the enactment \r\n                of this section.\r\n                    (B) Location requirement.--For each lease sale held \r\n                under this paragraph, the Secretary may offer for lease \r\n                only an area identified in Figure S-2 of the 2017-2022 \r\n                Outer Continental Shelf Oil and Gas Leasing Proposed \r\n                Final Program referenced in the notice of availability \r\n                published by the Bureau of Ocean Energy Management \r\n                titled ``Notice of Availability of the 2017-2022 Outer \r\n                Continental Shelf Oil and Gas Leasing Proposed Final \r\n                Program'' (81 Fed. Reg. 84612; published November 23, \r\n                2016).\r\n                    (C) Acreage requirement.--For each lease sale held \r\n                under this paragraph, the Secretary shall offer for \r\n                lease--\r\n                            (i) not fewer than 1,000,000 acres; or\r\n                            (ii) if there are fewer than 1,000,000 \r\n                        acres that are unleased, all such unleased \r\n                        acres.\r\n                    (D) Timing requirement.--Of the not fewer than 6 \r\n                lease sales required under this paragraph, the \r\n                Secretary shall hold not fewer than 1 lease sale on or \r\n                before each of the following dates:\r\n                            (i) March 15, 2026.\r\n                            (ii) March 15, 2027.\r\n                            (iii) August 15, 2028.\r\n                            (iv) March 15, 2030.\r\n                            (v) August 15, 2031.\r\n                            (vi) March 15, 2032.\r\n                    (E) Lease terms and conditions.--For each lease \r\n                sale held under this paragraph, the Secretary shall \r\n                offer the same lease form, lease terms, economic \r\n                conditions, and stipulations as contained in the final \r\n                notice of sale titled ``Outer Continental Shelf Cook \r\n                Inlet, Alaska, Oil and Gas Lease Sale 244'' (82 Fed. \r\n                Reg. 23163; published May 22, 2017).\r\n                    (F) Revenue sharing.--Notwithstanding section 8(g) \r\n                and 9 of the Outer Continental Shelf Lands Act (43 \r\n                U.S.C. 1337(g) and 1338), and beginning in fiscal year \r\n                2035, of the bonuses, rents, royalties, and other \r\n                revenues derived from leases issued pursuant to this \r\n                paragraph--\r\n                            (i) 90 percent shall be paid to the State \r\n                        of Alaska; and\r\n                            (ii) 10 percent shall be deposited in the \r\n                        Treasury as miscellaneous receipts.\r\n    (b) Lease Sales Held Under Proposed Final Program.--The lease sales \r\nheld under this section shall be in addition to the lease sales held \r\nunder the Proposed Final Program for the 2024-2029 National Outer \r\nContinental Shelf Oil and Gas Leasing Program referenced in the notice \r\nof availability published by the Bureau of Ocean Energy Management \r\ntitled ``Notice of Availability of the 2024-2029 National Outer \r\nContinental Shelf Oil and Gas Leasing Proposed Final Program and Final \r\nProgrammatic Environmental Impact Statement'' (88 Fed. Reg. 67798; \r\npublished October 2, 2023).\r\n    (c) Other Requirements.--During the period beginning on the date of \r\nthe enactment of this section and ending on the date that is 2 years \r\nafter the date on which the last lease sale required to be held under \r\nthis section is held, with respect to each lease sale held, lease \r\nissued, and any activity that requires a Federal authorization and is \r\nassociated with a lease issued pursuant to this title, the Outer \r\nContinental Shelf Lands Act, or section 50264 of Public Law 117-169 in \r\nthe Gulf of America--\r\n            (1) adherence with the Biological Opinion shall satisfy the \r\n        Secretary's obligations under the Endangered Species Act of \r\n        1973 and the Marine Mammal Protection Act of 1972;\r\n            (2) the final programmatic environmental impact statement \r\n        referenced in the notice of availability titled ``Final \r\n        Programmatic Environmental Impact Statement for the 2017-2022 \r\n        Outer Continental Shelf (OCS) Oil and Gas Leasing Program'' (81 \r\n        Fed. Reg. 83870; published November 22, 2016), the Record of \r\n        Decision related to such final programmatic environmental \r\n        impact statement, and the final environmental impact statement \r\n        referenced in the notice of availability titled ``Final \r\n        Environmental Impact Statement for Outer Continental Shelf, \r\n        Gulf of Mexico, 2017-2022 Oil and Gas Lease Sales 249, 250, \r\n        251, 252, 253, 254, 256, 257, 259, and 261'' (82 Fed. Reg. \r\n        13363; published March 10, 2017) shall satisfy the Secretary's \r\n        obligations under the National Environmental Policy Act of 1969 \r\n        and division A of subtitle III of title 54, United States Code; \r\n        and\r\n            (3) the consistency determinations prepared by the Bureau \r\n        of Ocean Energy Management under section 307 of the Coastal \r\n        Zone Management Act of 1972 (16 U.S.C. 1456) for Lease Sale 261 \r\n        for the States of Texas, Louisiana, Mississippi, Alabama, and \r\n        Florida shall satisfy the Secretary's obligations under that \r\n        section (16 U.S.C. 1456).\r\n    (d) Issuance of Leases.--If the Secretary receives an acceptable \r\nbid for an area offered in a lease sale held under this section, the \r\nSecretary shall--\r\n            (1) in accordance with section 8 of the Outer Continental \r\n        Shelf Lands Act (43 U.S.C. 1337), accept the highest acceptable \r\n        bid for such area; and\r\n            (2) not later than 90 days after the date on which the \r\n        applicable lease sale ends, issue a lease of the area to the \r\n        highest responsible qualified bidder.\r\n    (e) Nomination of Areas for Inclusion in Lease Sale by Governor.--\r\n            (1) In general.--The Secretary shall establish a process \r\n        through which the Governor of a State may nominate for leasing \r\n        under a lease sale held under this section an area of the outer \r\n        Continental Shelf that is--\r\n                    (A) adjacent to the waters of the State; and\r\n                    (B) unleased and available for leasing.\r\n            (2) Inclusion of nominated area.--If under paragraph (1) \r\n        the Governor of a State nominates an area described in that \r\n        paragraph for leasing under a lease sale held under this \r\n        section, the Secretary shall include the area in the next \r\n        scheduled lease sale under subsection (a)(1)(D).\r\n    (f) Geological and Geophysical Surveys.--Not later than 30 days \r\nafter the date on which the Secretary receives a complete application \r\npursuant to section 551.5 of title 30, Code of Federal Regulations (as \r\nin effect on September 22, 2015), to conduct a geological or \r\ngeophysical survey pursuant to oil and gas activities on the outer \r\nContinental Shelf, the Secretary shall approve such application.\r\n    (g) Lease Sale 259 and Lease Sale 261 Leases.--\r\n            (1) Leasing revenue certainty.--A lease awarded under Lease \r\n        Sale 259 or Lease Sale 261, which has been fully executed by \r\n        the Secretary, shall not be set aside, vacated, enjoined, \r\n        suspended, or cancelled except in accordance with section 5 of \r\n        the Outer Continental Shelf Lands Act (43 U.S.C. 1334).\r\n            (2) No additional terms or conditions.--The Secretary shall \r\n        not impose any additional terms or conditions on a lease \r\n        awarded under Lease Sale 259 or Lease Sale 261, which has been \r\n        fully executed by the Secretary, that were not included in the \r\n        Bureau of Ocean Energy Management final notice of sale titled \r\n        ``Gulf of Mexico Outer Continental Shelf Oil and Gas Lease Sale \r\n        259'' (88 Fed. Reg. 12404; published Feb. 27, 2023) or the \r\n        final notice of sale titled ``Gulf of Mexico Outer Continental \r\n        Shelf Oil and Gas Lease Sale 261'' (88 Fed. Reg. 80750; \r\n        published on Nov. 20, 2023).\r\n    (h) Judicial Review.--Section 23(c)(2) of the Outer Continental \r\nShelf Lands Act (43 U.S.C. 1349(c)(2)) is amended to read as follows:\r\n    ``(2) Any action of the Secretary to approve, require modification \r\nof, or disapprove any exploration plan, development and production \r\nplan, bidding procedure, lease sale, lease issuance, or permit or \r\nauthorization related to oil and gas exploration, development, or \r\nproduction under this Act, or any inaction by the Secretary resulting \r\nin the failure to hold a lease sale under any Federal law requiring oil \r\nand gas lease sales on the outer Continental Shelf, shall be subject to \r\njudicial review only in a United States court of appeals for a circuit \r\nin which an affected State is located.''.\r\n    (i) Definitions.--In this section:\r\n            (1) Acceptable bid.--The term ``acceptable bid'' means a \r\n        bid that meets the requirements of the document published by \r\n        the Bureau of Ocean Energy Management titled ``Summary of \r\n        Procedures for Determining Bid Adequacy at Offshore Oil and Gas \r\n        Lease Sales Effective March 2016, with Central Gulf of Mexico \r\n        Sale 241 and Eastern Gulf of Mexico Sale 226''.\r\n            (2) Biological opinion.--The term ``Biological Opinion''--\r\n                    (A) means the biological opinion issued by the \r\n                National Marine Fisheries Service titled ``Biological \r\n                Opinion on the Federally Regulated Oil and Gas Program \r\n                Activities in the Gulf of Mexico'' and the incidental \r\n                take statement associated with such biological opinion \r\n                (published March 12, 2020, and updated April 26, 2021); \r\n                and\r\n                    (B) does not include sections 3.3.1 through 3.3.3 \r\n                of such biological opinion.\r\n            (3) Lease.--The term ``lease'' means an oil and gas lease.\r\n            (4) Lease sale 259.--The term ``Lease Sale 259'' means the \r\n        lease sale held by the Bureau of Ocean Energy Management on \r\n        March 29, 2023.\r\n            (5) Lease sale 261.--The term ``Lease Sale 261'' means the \r\n        lease sale held by the Bureau of Ocean Energy Management on \r\n        December 20, 2023.\r\n            (6) Outer continental shelf.--The term ``outer Continental \r\n        Shelf'' has the meaning given such term in section 2 of the \r\n        Outer Continental Shelf Lands Act (43 U.S.C. 1331).\r\n            (7) Secretary.--The term ``Secretary'' means the Secretary \r\n        of the Interior.",
    "summary": "Overrides the Interior Department’s 2024‑2029 five‑year program and mandates (1) at least 30 Gulf‑of‑Mexico sales over 15 years—one every six months—with ≥80 million acres offered each time and Gulf lease terms pegged to the 2020 Sale 254 conditions; (2) six Cook Inlet sales over ten years with ≥1 million acres each; (3) 90‑day lease issuance deadlines; (4) sweeping NEPA, ESA, and CZMA shortcuts declaring prior programmatic EISs and biological opinions sufficient for all future sales and project authorizations; (5) exclusive appellate‑court jurisdiction for any related lawsuits.",
    "impact": "• **Supply flood vs. demand realities.**  The mandated acreage (>2.4 billion acres total) dwarfs industry interest—only 1.2 % of GOM tracts received bids in Sale 261—raising the odds of no‑bid sales and wasted administrative effort.  \n• **Fiscal exposure.**  Automatic issuance after the ‘acceptable bid’ test strips Interior of flexibility to reject lowball offers, potentially selling public assets below value.  \n• **Legal vulnerability.**  Pre‑emptively deeming decade‑old EISs adequate for projects through 2040 ignores new climate and hurricane‑risk data, inviting ‘arbitrary and capricious’ challenges that could invalidate subsequent permits despite the jurisdictional funnel.  \n• **State windfalls, federal shortfall.**  Beginning in FY 2035, 90 % of Cook Inlet revenues shift to Alaska, eroding federal receipts and creating an incentive mismatch between states and national climate goals.",
    "additionalReferences": [
      "https://www.boem.gov/sites/default/files/documents/energy-programs/2024-2029-proposed-final-program.pdf",
      "https://www.boem.gov/sites/default/files/documents/regions/gulf-mexico-ocs-region/Lease-Sale-261-Statistical-Report.pdf"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "8",
    "sectionNumber": "80172",
    "sectionTitle": "Offshore Commingling",
    "sectionText": "SEC. 80172. OFFSHORE COMMINGLING.\r\n\r\n     The Secretary of the Interior shall approve operator requests to \r\ncommingle production from multiple reservoirs within a single wellbore \r\ncompleted on the Outer Continental Shelf of the Gulf of America unless \r\nconclusive evidence establishes that such commingling--\r\n            (1) could not be conducted in a safe manner; or\r\n            (2) would result in the ultimate recovery from such \r\n        formations being reduced.",
    "summary": "Requires Interior to approve requests to commingle production from different reservoirs in a single Gulf of Mexico wellbore unless agency engineers can prove doing so would be unsafe or would reduce ultimate recovery.",
    "impact": "• **Operator flexibility.**  Eases administrative bottlenecks for marginal‑pool tie‑backs, potentially recovering more barrels per platform and lowering per‑barrel emissions.  \n• **Measurement risk.**  BOEM’s 2011 NTL warned that commingling can obscure reservoir performance and royalty allocation; automatic approval flips the burden of proof and may heighten mis‑measurement disputes.  \n• **Data transparency.**  Without robust down‑hole metering, the policy could under‑report gas leakage or flaring events, complicating methane‑fee enforcement.",
    "additionalReferences": [
      "https://www.boem.gov/sites/default/files/uploadedFiles/BOEM/Oil_and_Gas_Energy_Program/Leasing/Fair_ways_and_Means/NTL-2011-G03.pdf",
      "https://www.onrr.gov/sites/default/files/2021-11/Royalty%20Measurement.pdf"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "8",
    "sectionNumber": "80173",
    "sectionTitle": "Limitations on Amount of Distributed Qualified OCS Revenues",
    "sectionText": "SEC. 80173. LIMITATIONS ON AMOUNT OF DISTRIBUTED QUALIFIED OUTER \r\n              CONTINENTAL SHELF REVENUES.\r\n\r\n    Section 105(f)(1) of the Gulf of Mexico Energy Security Act of 2006 \r\n(43 U.S.C. 1331 note) is amended--\r\n            (1) in subparagraph (B), by striking ``and'' at the end;\r\n            (2) in subparagraph (C), by striking ``2055.'' and \r\n        inserting ``2024;''; and\r\n            (3) by adding at the end the following:\r\n                    ``(D) $650,000,000 for each of fiscal years 2025 \r\n                through 2034; and\r\n                    ``(E) $500,000,000 for each of fiscal years 2035 \r\n                through 2055.''.",
    "summary": "Amends GOMESA to raise the annual cap on shared Gulf of Mexico leasing revenues: from $375 million today to $650 million (FY 2025‑2034) and $500 million (FY 2035‑2055) that can be split 50:50 between Gulf states and the Land & Water Conservation Fund.",
    "impact": "• **Budget pressure.**  CBO scored similar increases as adding $2–3 billion in outlays over a decade because payments to states are mandatory; without offsetting revenues, the provision widens the deficit.  \n• **Uneven benefits.**  Louisiana alone would receive ~$150 million extra per year, while non‑producing coastal states get nothing—intensifying calls for a broader revenue‑sharing framework.  \n• **LWCF squeeze.**  Higher state caps reduce the slice automatically credited to LWCF once the ceiling is hit, potentially under‑funding conservation projects Congress assumed would succeed post‑Great American Outdoors Act.",
    "additionalReferences": [
      "https://crsreports.congress.gov/product/pdf/IF/IF11416",
      "https://www.cbo.gov/system/files/2021-09/s_2130.pdf"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "9",
    "sectionNumber": "80181",
    "sectionTitle": "Renewable Energy Fees on Federal Lands",
    "sectionText": "SEC. 80181. RENEWABLE ENERGY FEES ON FEDERAL LANDS.\r\n\r\n    (a) Acreage Rent for Wind and Solar Rights-of-way.--\r\n            (1) In general.--Under the second sentence of section \r\n        504(g) of the Federal Land Policy and Management Act of 1976 \r\n        (43 U.S.C. 1764(g)), the Secretary shall, subject to paragraph \r\n        (3) and not later than January 1 of each calendar year, collect \r\n        from the holder of a right-of-way for a renewable energy \r\n        project an acreage rent in an amount based on the equation \r\n        described in paragraph (2).\r\n            (2) Calculation of acreage rent rate.--\r\n                    (A) Equation.--The amount of an acreage rent \r\n                collected under paragraph (1) shall be determined using \r\n                the following equation: Acreage rent = A  x  B  x  ((1 \r\n                + C)\\D\\)).\r\n                    (B) Definitions.--For purposes of subparagraph (A):\r\n                            (i) The letter ``A'' means the Per-Acre \r\n                        Rate.\r\n                            (ii) The letter ``B'' means the Encumbrance \r\n                        Factor.\r\n                            (iii) The letter ``C'' means the Annual \r\n                        Adjustment Factor.\r\n                            (iv) The letter ``D'' means the year in the \r\n                        term of the right-of-way.\r\n            (3) Payment until production.--The holder of a right-of-way \r\n        for a renewable energy project shall pay an acreage rent \r\n        collected under paragraph (1) until the date on which energy \r\n        generation begins.\r\n    (b) Capacity Fees.--\r\n            (1) In general.--The Secretary shall, subject to paragraph \r\n        (2), annually collect a capacity fee from the holder of a \r\n        right-of-way for a renewable energy project based on the amount \r\n        described in paragraph (2).\r\n            (2) Calculation of capacity fee.--The amount of a capacity \r\n        fee collected under paragraph (1) shall be equal to the greater \r\n        of--\r\n                    (A) an amount equal to the acreage rent described \r\n                in subsection (a); and\r\n                    (B) 4.58 percent of the gross proceeds from the \r\n                sale of electricity produced by the renewable energy \r\n                project.\r\n            (3) Multiple-use reduction factor.--\r\n                    (A) Application.--The holder of a right-of-way for \r\n                a wind energy generation project may request that the \r\n                Secretary apply a 10-percent Multiple-Use Reduction \r\n                Factor to the amount of a capacity fee determined under \r\n                paragraph (2) by submitting to the Secretary an \r\n                application for approval.\r\n                    (B) Approval.--The Secretary may approve an \r\n                application submitted under subparagraph (A) if not \r\n                less than 25 percent of the land within the area of the \r\n                right-of-way is authorized for use, occupancy, or \r\n                development with respect to an activity other than the \r\n                generation of wind energy for the entirety of the year \r\n                in which the capacity fee is collected.\r\n                    (C) Late determination.--If the Secretary approves \r\n                an application under subparagraph (B) for a wind energy \r\n                generation project after the date on which the holder \r\n                of the right-of-way for the project begins paying a \r\n                capacity fee, the Secretary shall apply the Multiple-\r\n                Use Reduction Factor to the capacity fee in the \r\n                following years. Under this subparagraph, the Secretary \r\n                may not refund the holder of a right-of-way for the \r\n                difference in the amount of a capacity fee paid in a \r\n                previous year.\r\n    (c) Late Payment Fee; Termination.--\r\n            (1) In general.--The Secretary may charge the holder of a \r\n        right-of-way for a renewable energy project a late payment fee \r\n        if the Secretary does not receive payment for the acreage rent \r\n        under subsection (a) or the capacity fee under subsection (b) \r\n        by the date that is 15 days after the date on which the payment \r\n        was due.\r\n            (2) Termination of right-of-way.--The Secretary may \r\n        terminate a right-of-way for a renewable energy project if the \r\n        Secretary does not receive payment for the acreage rent under \r\n        subsection (a) or the capacity fee under subsection (b) by the \r\n        date that is 90 days after the date on which the payment was \r\n        due.\r\n    (d) Revenue Accuracy, Transparency, and Accountability.--The \r\nSecretary shall document, verify, and make publicly available the \r\nrespective amount of wind and solar energy revenues collected under \r\nthis section on the Department of the Interior's Natural Resources \r\nRevenue Data website.\r\n    (e) Ensuring Fee Certainty.--Section 3103 of the Energy Act of 2020 \r\n(43 U.S.C. 3003) is repealed.\r\n    (f) Definitions.--In this section:\r\n            (1) Annual adjustment factor.--The term ``Annual Adjustment \r\n        Factor'' means 3 percent.\r\n            (2) Encumbrance factor.--The term ``Encumbrance Factor'' \r\n        means--\r\n                    (A) 100 percent for solar energy generation \r\n                facilities; and\r\n                    (B) an amount determined by the Secretary not less \r\n                than 10 percent for wind energy generation facilities.\r\n            (3) Per-acre rate.--The term ``Per-Acre Rate'' means the \r\n        average of per-acre pastureland rental rates published in the \r\n        Cash Rents Survey by the National Agricultural Statistics \r\n        Service for the State in which the right-of-way is located over \r\n        the 5 calendar-year period preceding the issuance or renewal of \r\n        the right-of-way.\r\n            (4) Project.--The term ``project'' means a system described \r\n        in section 2801.9(a)(4) of title 43, Code of Federal \r\n        Regulations (as such section is in effect on the date of the \r\n        enactment of this Act).\r\n            (5) Public lands.--The term ``public lands'' means--\r\n                    (A) public lands as such term is defined in section \r\n                103 of the Federal Land Policy and Management Act of \r\n                1976 (43 U.S.C. 1702); and\r\n                    (B) the lands of the National Forest System as \r\n                described in section 11(a) of the Forest and Rangeland \r\n                Renewable Resources Planning Act of 1974 (16 U.S.C. \r\n                1609(a)).\r\n            (6) Renewable energy project.--The term ``renewable energy \r\n        project'' means a project located on public lands that uses \r\n        wind or solar energy to generate energy.\r\n            (7) Right-of-way.--The term ``right-of-way'' has the \r\n        meaning given such term in section 103 of the Federal Land \r\n        Policy and Management Act of 1976 (43 U.S.C. 1702).\r\n            (8) Secretary.--The term ``Secretary'' means--\r\n                    (A) the Secretary of the Interior with respect to \r\n                land controlled or administered by the Secretary of the \r\n                Interior; or\r\n                    (B) the Secretary of Agriculture with respect to \r\n                the lands of the National Forest System controlled or \r\n                administered by the Secretary of Agriculture.",
    "summary": "Replaces the Energy Act 2020 rent‑and‑fee framework with a statutory formula that (1) charges developers an upfront acreage rent pegged to local pastureland values, escalated by 3 % every year, until a project begins generating electricity; (2) imposes an annual capacity fee equal to the larger of that rent or 4.58 % of gross power sales, with a narrow 10 % discount for wind facilities that demonstrably share at least one‑quarter of the right‑of‑way with other land uses; (3) authorises late‑payment penalties and outright lease termination after 90 days of non‑payment; (4) directs Interior to publish revenue data online; and (5) repeals § 3103 of the 2020 Energy Act, eliminating the Department’s current authority to reduce rents and capacity fees.",
    "impact": "• **Cost headwinds for new utility‑scale projects.**  The mandatory 4.58 % gross‑revenue charge is materially higher than the sliding‑scale (often <3 %) fees Interior adopted in its 2024 Renewable‑Energy Rule, and the annual 3 % escalator locks in real growth even if power prices fall.  Developers are likely to re‑rank sites toward private or state trust lands, slowing federal‑land build‑out.  :contentReference[oaicite:0]{index=0}\n• **Revenue upside—at a climate‑policy trade‑off.**  Treasury receipts rise, but Interior’s own rulemaking record shows lower fees were intended to accelerate deployment toward the 25‑GW federal‑land target.  Re‑tightening fees could jeopardise that momentum, conflicting with administration decarbonisation deadlines.  :contentReference[oaicite:1]{index=1}\n• **Financing and insurance risks.**  Automatic lease cancellation after 90 days of delinquency, without a cure period tied to force‑majeure events, elevates lender risk.  Higher cost of capital may be passed through to rate‑payers or erode project pipelines.\n• **Signal for multiple‑use conflicts.**  A modest 10 % discount for co‑location may be too small to incentivise livestock‑grazing or recreation overlaps, undercutting congressional intent to balance uses on public lands.",
    "additionalReferences": [
      "https://www.federalregister.gov/documents/2024/05/01/2024-08099/rights-of-way-leasing-and-operations-for-renewable-energy",
      "https://www.reuters.com/world/us/us-surpasses-renewable-energy-goal-public-lands-2024-04-11/"
    ]
  },
  {
    "titleNumber": "VIII",
    "subtitle": "A",
    "part": "9",
    "sectionNumber": "80182",
    "sectionTitle": "Renewable Energy Revenue Sharing",
    "sectionText": "SEC. 80182. RENEWABLE ENERGY REVENUE SHARING.\r\n\r\n    (a) Disposition of Revenue.--\r\n            (1) Disposition of revenues.--Beginning on January 1, 2026, \r\n        the amounts collected from a renewable energy project as bonus \r\n        bids, rentals, fees, or other payments under a right-of-way, \r\n        permit, lease, or other authorization shall be--\r\n                    (A) deposited in the general fund of the Treasury; \r\n                and\r\n                    (B) without further appropriation or fiscal year \r\n                limitation, allocated as follows:\r\n                            (i) 25 percent shall be paid from amounts \r\n                        in the general fund of the Treasury to the \r\n                        State within the boundaries of which the \r\n                        revenue is derived.\r\n                            (ii) 25 percent shall be paid from amounts \r\n                        in the general fund of the Treasury to each \r\n                        county within the boundaries of which the \r\n                        revenue is derived, to be allocated among each \r\n                        such county based on the percentage of land \r\n                        from which the revenue is derived.\r\n            (2) Payments to states and counties.--\r\n                    (A) In general.--The amounts paid to States and \r\n                counties under paragraph (1) shall be used consistent \r\n                with section 35 of the Mineral Leasing Act (30 U.S.C. \r\n                191).\r\n                    (B) Payments in lieu of taxes.--A payment to a \r\n                county under paragraph (1) shall be in addition to a \r\n                payment in lieu of taxes received by the county under \r\n                chapter 69 of title 31, United States Code.\r\n                    (C) Timing.--The amounts required to be paid under \r\n                paragraph (1)(B) for an applicable fiscal year shall be \r\n                made available not later than the fiscal year that \r\n                immediately follows the fiscal year for which the \r\n                amounts were collected.\r\n    (b) Definitions.--In this section:\r\n            (1) Covered land.--The term ``covered land'' means land \r\n        that is--\r\n                    (A) public lands administered by the Secretary; and\r\n                    (B) not excluded from the development of solar or \r\n                wind energy under--\r\n                            (i) a land use plan; or\r\n                            (ii) other Federal law.\r\n            (2) Public lands.--The term ``public lands'' means--\r\n                    (A) public lands as such term is defined in section \r\n                103 of the Federal Land Policy and Management Act of \r\n                1976 (43 U.S.C. 1702); and\r\n                    (B) lands of the National Forest System as \r\n                described in section 11(a) of the Forest and Rangeland \r\n                Renewable Resources Planning Act of 1974 (16 U.S.C. \r\n                1609(a)).\r\n            (3) Renewable energy project.--The term ``renewable energy \r\n        project'' means a system described in section 2801.9(a)(4) of \r\n        title 43, Code of Federal Regulations (as such section is in \r\n        effect on the date of the enactment of this Act), located on \r\n        covered land that uses wind or solar energy to generate energy.\r\n            (4) Secretary.--The term ``Secretary'' means--\r\n                    (A) the Secretary of the Interior with respect to \r\n                land controlled or administered by the Secretary of the \r\n                Interior; or\r\n                    (B) the Secretary of Agriculture with respect to \r\n                the lands of the National Forest System controlled or \r\n                administered by the Secretary of Agriculture.",
    "summary": "Beginning 1 Jan 2026, 50 % of all federal receipts (bonus bids, rents, capacity fees, etc.) from wind or solar projects on public lands are automatically sent back to host jurisdictions—split 25 % to the State and 25 % to the affected counties—while the remaining 50 % stays in the U.S. Treasury.  Payments must mirror Mineral‑Leasing‑Act revenue‑use rules, arrive in the following fiscal year, and are explicitly *in addition* to PILT payments.  Key definitions mirror those in § 80181 but confine sharing to lands not otherwise excluded from renewable development.",
    "impact": "• **Powerful carrot for Western states.**  Direct revenue participation aligns local politics with large‑scale solar and wind siting—particularly in high‑potential but opposition‑prone counties in AZ, NV, WY and NM.  The double‑dip with PILT further sweetens the pot for sparsely populated counties that host the largest footprints.\n• **Federal budget foregone.**  Treasury retains only half of a revenue stream Congress just boosted in § 80181, reducing the federal fiscal benefit and making federal land management more reliant on appropriations.\n• **Equity and project‑mix concerns.**  States with little federal land (e.g., eastern seaboard) see no benefit, potentially widening regional clean‑energy cost differentials.  Tribes and private‑land owners receive no analogous share, raising parity questions.\n• **Implementation friction.**  County‑level allocations are tied to the percentage of leased acreage, a metric Interior does not currently track in its revenue database—necessitating new GIS accounting systems and auditing protocols.",
    "additionalReferences": [
      "https://www.federalregister.gov/documents/2024/05/01/2024-08099/rights-of-way-leasing-and-operations-for-renewable-energy",
      "https://www.blm.gov/about/laws-and-regulations/renewable-energy-rule"
    ]
  }
]
