[
  {
    "titleNumber": "X",
    "subtitle": "",
    "sectionNumber": "100001",
    "sectionTitle": "Coast Guard assets necessary to secure the maritime border and interdict migrants and drugs",
    "sectionText": "SEC. 100001. COAST GUARD ASSETS NECESSARY TO SECURE THE MARITIME BORDER \r\n              AND INTERDICT MIGRANTS AND DRUGS.\r\n\r\n    (a) In General.--For the purpose of the acquisition, sustainment, \r\nimprovement, and operation of United States Coast Guard assets, in \r\naddition to amounts otherwise made available, there is appropriated to \r\nthe Commandant of the Coast Guard for fiscal year 2025, out of any \r\nmoney in the Treasury not otherwise appropriated, to remain available \r\nuntil September 30, 2029--\r\n            (1) $571,500,000 for fixed wing aircraft and spare parts, \r\n        training simulators, support equipment, and program management \r\n        for such aircraft;\r\n            (2) $1,283,000,000 for rotary wing aircraft and spare \r\n        parts, training simulators, support equipment, and program \r\n        management for such aircraft;\r\n            (3) $140,000,000 for long-range unmanned aircraft systems \r\n        and base stations, support equipment, and program management \r\n        for such systems;\r\n            (4) $4,300,000,000 for Offshore Patrol Cutters and spare \r\n        parts and program management for such Cutters;\r\n            (5) $1,000,000,000 for Fast Response Cutters and spare \r\n        parts and program management for such Cutters;\r\n            (6) $4,300,000,000 for Polar Security Cutters and spare \r\n        parts and program management for such Cutters;\r\n            (7) $4,978,000,000 for Arctic Security Cutters and domestic \r\n        icebreakers and spare parts and program management for such \r\n        Cutters and icebreakers;\r\n            (8) $3,154,500,000 for design, planning, engineering, \r\n        construction of, and program management for shoreside \r\n        infrastructure, of which--\r\n                    (A) $400,000,000 is provided for hangers and \r\n                maintenance and crew facilities for the fixed wing \r\n                aircraft for which funds are appropriated under \r\n                paragraph (1) and rotary wing aircraft for which funds \r\n                are appropriated under paragraph (2);\r\n                    (B) $2,329,500,000 is provided for homeports for \r\n                the Cutters for which funds are appropriated under \r\n                paragraphs (4), (5), (6), and (7), National Security \r\n                Cutters, and other Fast Response Cutters; and\r\n                    (C) $425,000,000 is provided for design, planning, \r\n                engineering, construction of, and program management \r\n                for enlisted boot camp barracks, multi-use training \r\n                centers, and other related facilities;\r\n            (9) $1,300,000,000 for aviation, cutter, shoreside facility \r\n        depot maintenance, and C5I service maintenance, of which \r\n        $500,000,000 is provided to acquire, procure, or construct a \r\n        floating dry dock under subsection (b) and conduct channel \r\n        dredging necessary to allow Cutters for which funds are \r\n        appropriated under paragraph (4) and National Security Cutters \r\n        to be maintained and repaired in such dry dock; and\r\n            (10) $180,000,000 for equipment and services for maritime \r\n        domain awareness, of which $75,000,000 is provided to contract \r\n        the services of, acquire, or procure autonomous maritime \r\n        systems.\r\n    (b) Requirements.--\r\n            (1) In general.--Except as provided in paragraph (2), the \r\n        Commandant may not acquire, procure, or construct a floating \r\n        dry dock for the Coast Guard Yard with amounts appropriated \r\n        under subsection (a).\r\n            (2) Permissible acquisition, procurement, or construction \r\n        methods.--Notwithstanding paragraph (1) of this subsection and \r\n        section 1105(a) of title 14, United States Code, the Commandant \r\n        may, through September 30, 2030--\r\n                    (A) provide for an entity other than the Coast \r\n                Guard to contract for the acquisition, procurement, or \r\n                construction of a floating dry dock by contract, \r\n                purchase, or other agreement;\r\n                    (B) construct a floating dry dock at the Coast \r\n                Guard Yard; or\r\n                    (C) acquire or procure a commercially available \r\n                floating dry dock.\r\n            (3) Floating dry dock defined.--In this section, the term \r\n        ``floating dry dock'' means equipment that is--\r\n                    (A) documented under chapter 121 of title 46, \r\n                United States Code; and\r\n                    (B) capable of meeting the lifting and maintenance \r\n                requirements of an Offshore Patrol Cutter or a National \r\n                Security Cutter.\r\n    (c) Limitation.--Not more than 15 percent of the amounts provided \r\nin paragraph (9) of subsection (a) shall be available for design, \r\nplanning, and engineering of the facilities described in such \r\nparagraph.\r\n    (d) Application.--In carrying out acquisitions or procurements for \r\nwhich funds are appropriated under subsection (a), sections 1131, 1132, \r\nand 1133 of title 14, United States Code, shall not apply.\r\n    (e) Entity Other Than the Coast Guard.--Notwithstanding section \r\n1105(a) of title 14, United States Code, in carrying out acquisition, \r\nprocurement, or construction of Arctic Security Cutters or domestic \r\nicebreakers for which funds are appropriated under subsection (a)(7), \r\nthe Commandant may provide for an entity other than the Coast Guard to \r\ncontract for such acquisition, procurement, or construction.\r\n    (f) Compliance With Applicable Reporting Requirements.--None of the \r\namounts provided in--\r\n            (1) this section may be obligated or expended during any \r\n        fiscal year in which the Commandant is not compliant with \r\n        sections 5102 and 5103 (excluding section 5103(e)) of title 14, \r\n        United States Code; and\r\n            (2) paragraphs (1) and (2) of subsection (a) may be \r\n        obligated or expended until the Commandant provides the report \r\n        required under section 11217 of the James M. Inhofe National \r\n        Defense Authorization Act for Fiscal Year 2023 (Public Law 117-\r\n        263) to the Committee on Transportation and Infrastructure of \r\n        the House of Representatives and the Committee on Commerce, \r\n        Science, and Transportation of the Senate.\r\n    (g) Notification Requirement.--The Commandant shall notify the \r\nCommittee on Transportation and Infrastructure of the House of \r\nRepresentatives and the Committee on Commerce, Science, and \r\nTransportation of the Senate not less than 1 week prior to taking any \r\nprocurement actions impacting estimated costs or timelines for \r\nacquisitions or procurements funded with amounts appropriated under \r\nthis section.\r\n    (h) Expenditure Plan.--Not later than 90 days after the date of \r\nenactment of this Act, the Commandant shall submit to the Committee on \r\nTransportation and Infrastructure of the House of Representatives and \r\nthe Committee on Commerce, Science, and Transportation of the Senate a \r\ndetailed expenditure plan, including projected project timelines for \r\neach acquisition and procurement funded under this section and a list \r\nof project locations to be funded under paragraphs (8) and (9) of \r\nsubsection (a).\r\n    (i) Exception.--If the President authorizes an exception under \r\nsection 1151(b) of title 14, United States Code, for any Coast Guard \r\nvessel, or the hull or superstructure of such vessel for which funds \r\nare appropriated under paragraphs (4) through (7) of subsection (a), no \r\nsuch funds shall be obligated until the President submits to the \r\nCommittee on Transportation and Infrastructure of the House of \r\nRepresentatives and the Committee on Commerce, Science, and \r\nTransportation of the Senate a written explanation of the circumstances \r\nrequiring such an exception in the national security interest, \r\nincluding--\r\n            (1) a confirmation that there are insufficient qualified \r\n        United States shipyards to meet the national security interest \r\n        without such exception; and\r\n            (2) actions taken by the President to enable qualified \r\n        United States shipyards to meet national security requirements \r\n        prior to the issuance of such an exception.",
    "summary": "Authorizes roughly $22 billion (FY 2025–2029) for a sweeping shopping list of Coast Guard ships, aircraft, unmanned systems, shoreside infrastructure, and depot maintenance—including $4.3 billion for Offshore Patrol Cutters (OPCs), $4.3 billion for Polar Security Cutters (PSCs), and $5 billion for a new class of Arctic Security Cutters/icebreakers.",
    "impact": "• **Funding dwarfs execution capacity.** GAO warns the Coast Guard’s major‑acquisition portfolio already exceeds realistic budget toplines by $8.2 billion, with the OPC and PSC programs years behind schedule and billions over baseline. Adding an even larger Arctic fleet risks spreading thin program‑management resources and compounding cost growth. :contentReference[oaicite:0]{index=0}\n\n• **Domestic shipyard bottlenecks.** U.S. yards capable of building ice‑class hulls are limited; the bill anticipates private‑sector shortages (requiring presidential waivers). Prior PSC delays stem largely from capacity and supply‑chain gaps, suggesting new Arctic cutters may slip well past 2029 delivery targets. :contentReference[oaicite:1]{index=1}\n\n• **Opportunity‑cost trade‑offs.** The Coast Guard’s aging medium endurance cutters, aviation fleet recapitalization, and IT modernization efforts remain unfunded. Diverting $5 billion to a floating dry dock and facility dredging may improve organic maintenance, but ties up capital that could address persistent personnel shortages and shore‑station resilience.\n\n• **Oversight loopholes.** By waiving key 14 U.S.C. §§ 1131‑1133 reporting disciplines and permitting third‑party contracting, the bill reduces congressional visibility into milestone slips and subcontractor performance—precisely the weaknesses GAO flagged in prior acquisition failures.",
    "additionalReferences": [
      "https://www.gao.gov/products/GAO-24-107488",
      "https://sgp.fas.org/crs/weapons/RL34391.pdf"
    ],
    "tags": [
      "federal workforce",
      "personnel",
      "law enforcement",
      "whistleblowers",
      "cost estimates",
      "compliance",
      "administration",
      "program integrity"
    ]
  },
  {
    "titleNumber": "X",
    "subtitle": "",
    "sectionNumber": "100002",
    "sectionTitle": "Vessel tonnage duties",
    "sectionText": "SEC. 100002. VESSEL TONNAGE DUTIES.\r\n\r\n    Section 60301 of title 46, United States Code, is amended--\r\n            (1) in subsection (a) by striking ``, for fiscal years 2006 \r\n        through 2010, and 2 cents per ton, not to exceed a total of 10 \r\n        cents per ton per year, for each fiscal year thereafter,''; and\r\n            (2) in subsection (b) by striking ``, for fiscal years 2006 \r\n        through 2010, and 6 cents per ton, not to exceed a total of 30 \r\n        cents per ton per year, for each fiscal year thereafter,''.",
    "summary": "Strikes language that has capped U.S. tonnage duties at 2 ¢ per ton (10 ¢ annual cap) on U.S‑flag vessels and 6 ¢ per ton (30 ¢ annual cap) on foreign‑flag vessels since FY 2010, potentially allowing the full statutory ceiling of 9 ¢/27 ¢ per port call to take effect and increasing Harbor Maintenance Trust Fund (HMTF) revenues.",
    "impact": "• **Modest revenue bump, high pass‑through.** CRS estimates each additional 1 ¢ per ton yields ~$100 million annually; lifting the cap could net $500‑600 million a year, but carriers are likely to pass costs to shippers—adding about $20‑30 per FEU on trans‑Pacific routes and raising landed prices for U.S. exports. :contentReference[oaicite:2]{index=2}\n\n• **Competitive imbalance.** Neighboring Canadian and Mexican ports do not impose comparable HMTF charges; higher U.S. fees could divert discretionary transshipment traffic, undercutting long‑shore labor hours at smaller Gulf and Great Lakes ports.\n\n• **Governance question.** Congress recently unlocked the HMTF surplus, yet the Corps of Engineers continues to underspend authorized dredging at low‑use harbors. Without performance safeguards, extra receipts may simply inflate the trust‑fund balance rather than accelerate maintenance at underserved ports.\n\n• **Administrative burden.** Removing the statutory cap without updating collection systems risks billing inconsistencies and litigation over vessels already pre‑paying annual maximums.",
    "additionalReferences": [
      "https://www.congress.gov/crs-product/IF11645",
      "https://reason.org/wp-content/uploads/alternatives-reforming-harbor-maintenance-trust-fund.pdf"
    ],
    "tags": [
      "federal workforce",
      "Inspector General",
      "enforcement",
      "compliance",
      "accountability",
      "whistleblowers",
      "public reporting",
      "regulations"
    ]
  },
  {
    "titleNumber": "X",
    "subtitle": "",
    "sectionNumber": "100003",
    "sectionTitle": "Registration fee on motor vehicles",
    "sectionText": "SEC. 100003. REGISTRATION FEE ON MOTOR VEHICLES.\r\n\r\n    (a) In General.--Chapter 1 of title 23, United States Code, is \r\namended by adding at the end the following:\r\n``Sec. 180. Registration fee on motor vehicles.\r\n    ``(a) In General.--The Administrator of the Federal Highway \r\nAdministration shall impose for each year the following registration \r\nfee amounts on the owner of a vehicle registered for operation by a \r\nState motor vehicle department:\r\n            ``(1) $250 for a covered electric vehicle.\r\n            ``(2) $100 for a covered hybrid vehicle.\r\n    ``(b) Withholding of Funds for Noncompliance.--The Administrator \r\nshall withhold, from amounts required to be apportioned to any State \r\nunder section 104(b), an amount equal to 125 percent to the amount \r\nrequired to be remitted under subsection (c)(2). The Administrator \r\nshall withhold the amount on the first day of each fiscal year \r\nbeginning after September 30, 2026, in which the State does not meet \r\nthe requirements of subsection (c).\r\n    ``(c) Collection and Remittance of Fee.--\r\n            ``(1) Collection of fee.--A State motor vehicle department \r\n        shall--\r\n                    ``(A) incorporate the collection of the fees \r\n                established under subsection (a) into the vehicle \r\n                registration and renewal processes administered by such \r\n                department, so long as such fees are imposed for each \r\n                year in which the fees are required; or\r\n                    ``(B) obtain approval from the Administrator to \r\n                establish an alternate means of compliance for the \r\n                collection of such fees that is acceptable to the \r\n                Administrator.\r\n            ``(2) Remittance of fee.--Not later than 30 days after the \r\n        last day of each month, a State motor vehicle department shall \r\n        remit to the Administrator the balance of the total fee amounts \r\n        collected under this section in the preceding month less the \r\n        portion reserved for administrative expenses under subsection \r\n        (e).\r\n    ``(d) Fee Assessment.--The amounts specified in subsection (a) \r\nshall be increased on an annual basis to account for the rate of \r\ninflation each fiscal year in accordance with the Consumer Price Index \r\nfor All Urban Consumers of the Bureau of Labor Statistics.\r\n    ``(e) Administrative Expenses.--In any fiscal year in which a State \r\nis in compliance with this section, such State may retain an amount not \r\nto exceed 1 percent of the total fees collected under this section for \r\nadministrative expenses.\r\n    ``(f) Applicability of Fees.--The fees imposed under paragraphs (1) \r\nand (2) of subsection (a) shall terminate on October 1, 2035.\r\n    ``(g) Definitions.--In this section:\r\n            ``(1) Covered electric vehicle.--The term `covered electric \r\n        vehicle' means a covered motor vehicle with an electric motor \r\n        as the sole means of propulsion of such vehicle.\r\n            ``(2) Covered motor vehicle.--The term `covered motor \r\n        vehicle' has the meaning given the term `motor vehicle' under \r\n        section 154(a) but excludes a motor vehicle that is a covered \r\n        farm vehicle or commercial motor vehicle (as such terms are \r\n        defined in section 390.5 of title 49, Code of Federal \r\n        Regulations).\r\n            ``(3) Covered hybrid vehicle.--The term `covered hybrid \r\n        vehicle' means a covered motor vehicle propelled by a \r\n        combination of an electric motor and an internal combustion \r\n        engine or other power source and components thereof.''.\r\n    (b) Implementation of Certain Processes.--\r\n            (1) Implementation.--The Administrator of the Federal \r\n        Highway Administration shall provide grants to State motor \r\n        vehicle departments to implement a process to carry out section \r\n        180 of title 23, United States Code.\r\n            (2) Funding.--Out of any money in the Treasury not \r\n        otherwise appropriated, $104,000,000 is to remain available \r\n        until September 30, 2029, beginning in the first fiscal year \r\n        following the date of enactment of this Act, for grants under \r\n        paragraph (1).\r\n            (3) Eligible amounts.--Each State motor vehicle department \r\n        may receive not more than $2,000,000 under this subsection.\r\n    (c) Regulations.--The Administrator shall issue such regulations \r\nand guidance as are necessary to--\r\n            (1) carry out section 180 of title 23, United States Code \r\n        (as added by this Act); and\r\n            (2) establish a process for the timely and accurate \r\n        remittance of fees collected under such section through an \r\n        electronic method.\r\n    (d) Report.--Not later than 2 years after the date of enactment of \r\nthis Act, the Administrator shall submit to the Committee on \r\nTransportation and Infrastructure of the House of Representatives and \r\nthe Committee on Environment and Public Works of the Senate a report on \r\nthe status of the implementation of section 180 of title 23, United \r\nStates Code (as added by this Act).\r\n    (e) Clerical Amendment.--The analysis for chapter 1 of title 23, \r\nUnited States Code, is amended by adding at the end the following:\r\n\r\n``180. Registration fee on motor vehicles.''.",
    "summary": "Creates a new federal annual registration fee of $250 on battery‑electric vehicles (BEVs) and $100 on hybrids, indexed to inflation and collected by state DMVs beginning FY 2027; non‑compliant states forfeit 125 % of the amount they fail to remit from their Highway Trust Fund formula dollars. Fees sunset after FY 2035; $104 million in grants (max $2 million per state) is provided for DMV system changes.",
    "impact": "• **Double‑tax dilemma.** Thirty‑plus states already impose separate EV fees (median $140 for BEVs). Layering a $250 federal levy would push the total well above what average drivers pay in federal gasoline tax (≈ $130 per 12,000 miles at 25 MPG), effectively penalizing EV owners relative to ICE motorists. :contentReference[oaicite:0]{index=0}\n\n• **Adoption headwind vs. climate goals.** ACEEE and BPC studies show high fixed fees depress EV uptake—especially for low‑income buyers—undermining federal decarbonization investments made in the IIJA and IRA. Mileage‑based user‑fees or per‑kWh road charges better align cost with use. :contentReference[oaicite:1]{index=1}\n\n• **State–federal friction.** The 125 % penalty threatens up to billions in surface‑transportation funds for states that opt instead for road‑usage‑charge pilots, hamstringing policy innovation and potentially delaying urgently needed highway repairs.\n\n• **Small fiscal gain, big administrative cost.** Even optimistic FHWA scenarios project < $1 billion a year by 2030—plugging < 3 % of the Highway Trust Fund shortfall—while DMVs must overhaul IT and refund fees to sellers of totaled vehicles, cutting into net revenue.",
    "additionalReferences": [
      "https://www.ncsl.org/transportation/special-registration-fees-for-electric-and-hybrid-vehicles",
      "https://taxfoundation.org/blog/ev-highway-trust-fund/"
    ],
    "tags": [
      "federal workforce",
      "appropriations",
      "staffing",
      "program funding",
      "administration",
      "state funding",
      "metrics"
    ]
  },
  {
    "titleNumber": "X",
    "subtitle": "",
    "sectionNumber": "100004",
    "sectionTitle": "Deposit of registration fee on motor vehicles",
    "sectionText": "SEC. 100004. DEPOSIT OF REGISTRATION FEE ON MOTOR VEHICLES.\r\n\r\n    Any amounts accrued pursuant to section 180 of title 23, United \r\nStates Code (as added by this Act), shall be deposited into the Highway \r\nTrust Fund.",
    "summary": "Directs that all revenues raised under the new §180 registration fees be credited to the Highway Trust Fund (HTF).",
    "impact": "• **Marginal fiscal relief.** Assuming 4 million BEVs and 3 million hybrids on the road by 2028, the fee yields ≈ $1.3 billion annually—little against the HTF’s $15‑20 billion yearly gap, leaving insolvency delayed by only months. :contentReference[oaicite:2]{index=2}\n\n• **Structural mismatch persists.** A flat fee ignores vehicle miles traveled, weight, and road damage, perpetuating inequities (a low‑mileage urban EV pays the same as a 25,000‑mile suburban one). Transportation economists warn such blunt instruments incentivize heavier electrified SUVs while failing to encourage efficient travel.\n\n• **Crowds out smarter pilots.** The IIJA’s national VMT‑fee pilot and state‑level road‑usage‑charge experiments could be undercut if policymakers treat the new HTF revenue as ‘solved,’ slowing the transition to a sustainable, technology‑neutral funding model.",
    "additionalReferences": [
      "https://bipartisanpolicy.org/blog/highway-trust-fund-impact-of-evs/",
      "https://crsreports.congress.gov/product/pdf/IF/IF11645"
    ],
    "tags": [
      "Inspector General",
      "personnel",
      "staffing",
      "administration",
      "accountability",
      "cost estimates",
      "oversight",
      "hiring"
    ]
  },
  {
    "titleNumber": "X",
    "subtitle": "",
    "sectionNumber": "100005",
    "sectionTitle": "Motor carrier data",
    "sectionText": "SEC. 100005. MOTOR CARRIER DATA.\r\n\r\n    (a) Public Confirmation of Authorized Motor Carriers.--There is \r\nappropriated $5,000,000 to the Administrator of the Federal Motor \r\nCarrier Safety Administration to establish a public website to present \r\ndata on motor carriers, as such term is defined in section 13102 of \r\ntitle 49, United States Code, in a manner that indicates whether each \r\nmotor carrier meets or does not meet all Administration operating \r\nrequirements, including by displaying 1 of the following statements for \r\neach motor carrier:\r\n            (1) ``This motor carrier meets Federal Motor Carrier Safety \r\n        Administration operating requirements and is authorized to \r\n        operate on the nation's roadways.''.\r\n            (2) ``This motor carrier does not meet Federal Motor \r\n        Carrier Safety Administration operating requirements and is not \r\n        authorized to operate on the nation's roadways.''.\r\n    (b) Usage Fee.--The Administrator shall assess an annual fee of \r\n$100 on each person seeking access to the website established under \r\nsubsection (a). In each fiscal year through fiscal year 2033, monies \r\ncollected under this subsection shall be--\r\n            (1) credited to the account in the Treasury from which the \r\n        Administrator incurs expenses for establishing, maintaining, \r\n        and updating the website required to be established under \r\n        subsection (a); and\r\n            (2) available for establishing, maintaining, and updating \r\n        such website without further appropriation.\r\n    (c) Determination.--A broker, freight forwarder, or household goods \r\nfreight forwarder, as such terms are defined in section 13102 of title \r\n49, United States Code, that uses the website established under \r\nsubsection (a) to ensure that a motor carrier engaged by such broker, \r\nfreight forwarder, or household goods freight forwarder meets Federal \r\nMotor Carrier Safety Administration operating requirements shall be \r\nconsidered to have taken reasonable and prudent determinations in \r\nengaging such motor carrier.",
    "summary": "Appropriates $5 million for FMCSA to launch a pay‑gated website that displays a simple ‘authorized / not‑authorized’ notice for every interstate motor carrier and charges each user a $100 annual access fee. Brokers or freight forwarders that rely on the site receive a statutory safe‑harbor against negligent‑selection claims.",
    "impact": "• **Paywall replaces free tools.** FMCSA already offers the SAFER Company Snapshot and public carrier‑authority files at no cost; imposing a $100 fee shifts compliance costs to thousands of small brokers and independent dispatchers while generating only ~$7 million a year—barely enough to run a modern database. :contentReference[oaicite:0]{index=0}\n\n• **False sense of security.** GAO has long questioned the reliability of FMCSA’s safety data; a binary green/red flag may encourage brokers to skip deeper vetting even though ‘authorized’ status does not confirm safe performance. The safe‑harbor clause could heighten crash risk and litigation against shippers and insurers. :contentReference[oaicite:1]{index=1}\n\n• **Equity & antitrust concerns.** Large logistics platforms can spread the fee over high volumes, but niche and minority‑owned brokers may absorb a proportionally larger hit—potentially consolidating market power.\n\n• **Questionable ROI.** A $5 million build budget is modest for a secure, API‑ready system handling millions of queries; FMCSA’s past IT rollouts have run multiples of that figure and suffered cybersecurity lapses.",
    "additionalReferences": [
      "https://www.ccjdigital.com/regulations/article/15744362/budget-proposal-includes-funding-for-carrier-authority-confirmation",
      "https://www.gao.gov/products/gao-14-114"
    ],
    "tags": [
      "whistleblowers",
      "law enforcement",
      "reporting",
      "oversight",
      "accountability",
      "federal workforce",
      "civil rights",
      "compliance"
    ]
  },
  {
    "titleNumber": "X",
    "subtitle": "",
    "sectionNumber": "100006",
    "sectionTitle": "IRA rescissions",
    "sectionText": "SEC. 100006. IRA RESCISSIONS.\r\n\r\n    (a) Repeal of Funding for Alternative Fuel and Low-emission \r\nAviation Technology Program.--The unobligated balances of amounts made \r\navailable to carry out section 40007 of Public Law 117-169 (49 U.S.C. \r\n44504 note) (as in effect on the day before the date of enactment of \r\nthis Act) are permanently rescinded.\r\n    (b) Repeal of Funding for Neighborhood Access and Equity Grant \r\nProgram.--The unobligated balances of amounts made available to carry \r\nout section 177 of title 23, United States Code, (as in effect on the \r\nday before the date of enactment of this Act) are permanently \r\nrescinded.\r\n    (c) Repeal of Funding for Federal Building Assistance.--The \r\nunobligated balances of amounts made available to carry out section \r\n60502 of Public Law 117-169 (136 Stat. 2083) (as in effect on the day \r\nbefore the date of enactment of this Act) are permanently rescinded.\r\n    (d) Repeal of Funding for Use of Low-carbon Materials for Federal \r\nBuilding Assistance.-- The unobligated balances of amounts made \r\navailable to carry out section 60503 of Public Law 117-169 (136 Stat. \r\n2083) (as in effect on the day before the date of enactment of this \r\nAct) are permanently rescinded.\r\n    (e) Repeal of Funding for General Services Administration Emerging \r\nTechnologies.--The unobligated balances of amounts made available to \r\ncarry out section 60504 of Public Law 117-169 (136 Stat. 2083) (as in \r\neffect on the day before the date of enactment of this Act) are \r\npermanently rescinded.\r\n    (f) Repeal of Environmental Review Implementation Funds.--The \r\nunobligated balances of amounts made available to carry out section 178 \r\nof title 23, United States Code, (as in effect on the day before the \r\ndate of enactment of this Act) are permanently rescinded.\r\n    (g) Repeal of Funding for Low-carbon Transportation Materials \r\nGrants.-- The unobligated balances of amounts made available to carry \r\nout section 179 of title 23, United States Code, (as in effect on the \r\nday before the date of enactment of this Act) are permanently \r\nrescinded.",
    "summary": "Cancels all unobligated Inflation Reduction Act (IRA) funds for seven transportation‑ and building‑related climate programs—including sustainable aviation fuel (SAF) R&D, Neighborhood Access & Equity grants, low‑carbon construction materials, and environmental‑review assistance.",
    "impact": "• **Kills early‑stage climate projects.** The Sustainable Aviation Fuel initiative (IRA §40007) was poised to award up to $297 million for SAF testbeds; rescission stalls domestic SAF supply chains just as airlines face 2030 emissions targets. :contentReference[oaicite:2]{index=2}\n\n• **Strands shovel‑ready equity upgrades.** At least 78 communities have conditional awards under the Neighborhood Access and Equity program to cap highways, add transit, or mitigate freight pollution; those projects—and the local jobs promised—would evaporate overnight. :contentReference[oaicite:3]{index=3}\n\n• **Undermines federal‑building decarbonization.** Zero‑carbon concrete and steel pilots slated for GSA buildings lose seed money, slowing learning curves that the private sector relies on to scale low‑carbon materials and jeopardizing Buy Clean procurement goals.\n\n• **Limited deficit gain vs. market uncertainty.** Most balances are already obligated via multi‑year agreements; clawing them back could spark breach‑of‑contract payouts, eroding any net savings while injecting uncertainty into fledgling green‑tech markets.",
    "additionalReferences": [
      "https://iratracker.org/programs/1424/",
      "https://www.smartcitiesdive.com/news/house-republicans-rescind-reconnecting-communities-equity-grants/747089/"
    ],
    "tags": [
      "Inspector General",
      "compliance",
      "metrics",
      "evaluation",
      "public reporting",
      "administration",
      "program evaluation",
      "rulemaking"
    ]
  },
  {
    "titleNumber": "X",
    "subtitle": "",
    "sectionNumber": "100007",
    "sectionTitle": "Air traffic control staffing and modernization",
    "sectionText": "SEC. 100007. AIR TRAFFIC CONTROL STAFFING AND MODERNIZATION.\r\n\r\n    (a) In General.--For the purpose of the acquisition, construction, \r\nsustainment, improvement, and operation of facilities and equipment \r\nnecessary to improve or maintain aviation safety, and for personnel \r\nexpenses related to such facilities and equipment, in addition to \r\namounts otherwise made available, there is appropriated to the \r\nAdministrator of the Federal Aviation Administration for fiscal year \r\n2025, out of any money in the Treasury not otherwise appropriated, to \r\nremain available until September 30, 2029--\r\n            (1) $2,160,000,000 for air traffic control tower and \r\n        terminal radar approach control facility replacement, of which \r\n        not less than $240,000,000 shall be available for Contract \r\n        Tower Program air traffic control tower replacement and airport \r\n        sponsor-owned air traffic control tower replacement;\r\n            (2) $3,000,000,000 for radar systems replacement;\r\n            (3) $4,750,000,000 for telecommunications infrastructure \r\n        and systems replacement;\r\n            (4) $500,000,000 for runway safety projects, airport \r\n        surface surveillance projects, and to carry out section 347 of \r\n        the FAA Reauthorization Act of 2024;\r\n            (5) $550,000,000 for unstaffed infrastructure sustainment \r\n        and replacement;\r\n            (6) $300,000,000 to carry out section 619 of the FAA \r\n        Reauthorization Act of 2024;\r\n            (7) $260,000,000 to carry out section 44745 of title 49, \r\n        United States Code; and\r\n            (8) $1,000,000,000 for air traffic controller recruitment, \r\n        retention, training, and advanced training technologies.\r\n    (b) Quarterly Reporting.--Not later than 180 days after the date of \r\nenactment of this Act, and every 90 days thereafter, the Administrator \r\nshall submit to Congress a report that describes any expenditures under \r\nthis section.",
    "summary": "Appropriates nearly $12 billion (FY 2025‑2029) for FAA facilities, radar and telecom replacement, runway‑safety technology, resiliency upgrades, and $1 billion for controller hiring, retention, and advanced‑training systems; mandates quarterly spending reports.",
    "impact": "• **Execution capacity already strained.** GAO flags an $8 billion shortfall across FAA’s existing NextGen and ATC modernization portfolio, with 21 ‘unsustainable’ systems and chronic cost overruns; adding new multi‑billion‑dollar telecom and radar projects without a risk‑mitigation plan may widen delays and divert staff from critical fixes. :contentReference[oaicite:0]{index=0}\n\n• **Understaffing outpaces hiring money.** FAA was 3,000 controllers below its own target in 2024; even aggressive recruiting funded here cannot offset retirements unless training throughput and facility culture issues are solved—areas GAO and DOT‑IG say remain unaddressed. :contentReference[oaicite:1]{index=1}\n\n• **Telecom replacement déjà vu.** FAA’s prior telecom overhaul (FTI) ran 200 % over budget and five years late; the bill offers $4.75 billion for a new round but waives no procurement safeguards, risking repeat non‑competitive awards and cybersecurity gaps. :contentReference[oaicite:2]{index=2}\n\n• **Reporting without accountability.** Quarterly updates inform Congress yet the bill omits milestone or cost‑growth triggers—limiting leverage to correct drift before overruns become sunk costs.",
    "additionalReferences": [
      "https://www.gao.gov/products/gao-25-108162",
      "https://www.oig.dot.gov/sites/default/files/library-items/FAA%20IT%20and%20Telecom%20Contracts%20Final%20Report%202.26.2024.pdf"
    ],
    "tags": [
      "enforcement",
      "compliance",
      "Inspector General",
      "public service",
      "administration",
      "regulations",
      "program integrity",
      "whistleblowers"
    ]
  },
  {
    "titleNumber": "X",
    "subtitle": "",
    "sectionNumber": "100008",
    "sectionTitle": "John F. Kennedy Center for the Performing Arts",
    "sectionText": "SEC. 100008. JOHN F. KENNEDY CENTER FOR THE PERFORMING ARTS.\r\n\r\n    (a) In General.--In addition to amounts otherwise available, there \r\nis appropriated for fiscal year 2025, out of any money in the Treasury \r\nnot otherwise appropriated, $256,657,000, to remain available until \r\nSeptember 30, 2029, for necessary expenses for capital repair, \r\nrestoration, maintenance backlog, and security structures of the \r\nbuilding and site of the John F. Kennedy Center for the Performing \r\nArts.\r\n    (b) Administrative Costs.--Of the amounts made available under \r\nsubsection (a), not more than 3 percent may be used for administrative \r\ncosts necessary to carry out this section.",
    "summary": "Allocates $256.7 million (FY 2025‑2029) for capital repair, restoration, maintenance backlog, and security upgrades at the Kennedy Center, capping administrative costs at 3 %.",
    "impact": "• **Funding far exceeds historic needs.** GAO’s 2021 life‑cycle analysis estimated ~$25 million annually is sufficient to keep the Center in a state of good repair; a quarter‑billion dollar injection—10 × the normal request—raises questions about project scope and cost realism. :contentReference[oaicite:3]{index=3}\n\n• **Governance controversies.** Recent leadership turmoil and politicization have led to 90+ staff departures and an 82 % drop in subscription revenue; pouring capital funds into an institution facing existential operational risk may yield stranded assets if audiences and donors continue to flee. :contentReference[oaicite:4]{index=4}\n\n• **Opportunity cost vs. arts equity.** Concentrating scarce federal arts dollars on a single D.C. venue sidelines pressing facility needs at regional cultural centers nationwide—counter to NEA findings that rural venues face the greatest deferred‑maintenance gaps.\n\n• **Transparency gap.** Unlike FAA items, no periodic reporting or independent verification of cost estimates is required, leaving Congress in the dark on contract selection and change‑order escalation.",
    "additionalReferences": [
      "https://www.gao.gov/assets/gao-21-446.pdf",
      "https://www.wsj.com/business/media/maga-kennedy-center-trump-b9cc7589"
    ],
    "tags": [
      "federal workforce",
      "public service",
      "administration",
      "reporting",
      "accountability",
      "evaluation",
      "Inspector General",
      "metrics"
    ]
  }
]