[
  {
    "titleNumber": "V",
    "subtitle": "",
    "sectionNumber": "50001",
    "sectionTitle": "Green and Resilient Retrofit Program for Multifamily Housing",
    "sectionText": "SEC. 50001. GREEN AND RESILIENT RETROFIT PROGRAM FOR MULTIFAMILY FAMILY \r\n              HOUSING.\r\n\r\n    The unobligated balance of amounts made available under section \r\n30002(a) of Public Law 117-169 (commonly referred to as the ``Inflation \r\nReduction Act''; 136 Stat. 2027) are rescinded.",
    "summary": "Cancels the entire unobligated balance of HUD’s Green and Resilient Retrofit Program (GRRP) created by the Inflation Reduction Act. GRRP originally provided $837.5 million in grants and authority for up to $4 billion in below‑market loans so owners of HUD‑assisted multifamily properties could install heat pumps, high‑performance windows, solar PV, battery storage, and flood‑hardening measures. Eligible portfolios included Section 8, Section 202, Section 811, and other project‑based rental‑assistance contracts, with priority tiers for the most energy‑wasteful buildings and those in high‑climate‑risk ZIP codes. HUD has opened three funding rounds and announced roughly $300 million in preliminary awards, but the majority of funds remain unobligated and are now rescinded.",
    "impact": "Saves roughly $3.5–4 billion in future outlays, but it eliminates a rare financing tool for deep retrofits in low‑income housing. Owners will have to rely on more expensive green loans or defer upgrades, prolonging high tenant utility burdens (~23 % above national averages) and leaving 1970s‑era stock vulnerable to extreme heat and storms. HUD must unwind pending commitments and lay off GRRP staff. Approximately 30,000 trade and manufacturing jobs projected by HUD’s economic‑impact analysis will not materialize, and state clean‑energy plans lose a leverage point for hitting 2030 decarbonization targets.",
    "additionalReferences": [
      "https://archives.hud.gov/news/2024/pr24-262.cfm",
      "https://apnews.com/article/93a2f3c8d62e04db6963c680f77b7f78"
    ],
    "tags": [
      "housing",
      "energy",
      "climate resilience",
      "public investment",
      "low-income housing",
      "grants",
      "decarbonization",
      "infrastructure",
      "utilities",
      "job creation"
    ]
  },
  {
    "titleNumber": "V",
    "subtitle": "",
    "sectionNumber": "50002",
    "sectionTitle": "Public Company Accounting Oversight Board",
    "sectionText": "SEC. 50002. PUBLIC COMPANY ACCOUNTING OVERSIGHT BOARD.\r\n\r\n    (a) During the period beginning on the date of enactment of this \r\nAct and ending on the transfer date--\r\n            (1) all intellectual property retained by the Public \r\n        Company Accounting Oversight Board (``Board'') in support of \r\n        its programs for registration, standard-setting, and inspection \r\n        shall be shared with the Securities and Exchange Commission \r\n        (``Commission''); and\r\n            (2) pending enforcement and disciplinary actions of the \r\n        Board shall be referred to the Commission or another Federal \r\n        functional regulator (as defined in section 509 of the Gramm-\r\n        Leach-Bliley Act (15 U.S.C. 6809)) in accordance with section \r\n        105 of the Sarbanes-Oxley Act of 2002 (15 U.S.C. 7215).\r\n    (b) Effective on the transfer date--\r\n            (1) all unobligated fees collected under section 109(d) of \r\n        the Sarbanes-Oxley Act of 2002 shall be transferred to the \r\n        general fund of the Treasury, and the Commission may not \r\n        collect fees under such section 109(d);\r\n            (2) the duties and powers of the Board in effect as of the \r\n        day before the transfer date, other than those described in \r\n        section 107 of the Sarbanes-Oxley Act of 2002 (15 U.S.C. 7217), \r\n        shall be transferred to the Commission;\r\n            (3) the Commission may not use funds to carry out section \r\n        107 of the Sarbanes-Oxley Act of 2002 (15 U.S.C. 7217) for \r\n        activities related to overseeing the Board;\r\n            (4) the Board shall transfer all intellectual property \r\n        described in subsection (a)(1) to the Commission;\r\n            (5) existing processes and regulations of the Board, \r\n        including existing Board auditing standards, shall continue in \r\n        effect unless modified through rule making by the Commission; \r\n        and\r\n            (6) in connection with the duties and powers transferred \r\n        under paragraph (2), any reference to the Board in any law \r\n        implemented by a Federal functional regulator (as defined in \r\n        section 509 of the Gramm-Leach-Bliley Act (15 U.S.C. 6809)), in \r\n        any rule or guidance issued by a Federal functional regulator \r\n        (as defined in section 509 of the Gramm-Leach-Bliley Act (15 \r\n        U.S.C. 6809)), or in any records or other documents in the \r\n        possession of a Federal functional regulator (as defined in \r\n        section 509 of the Gramm-Leach-Bliley Act (15 U.S.C. 6809)), \r\n        shall be deemed a reference to the Commission.\r\n    (c) Any employee of the Board as of the date of enactment of this \r\nAct may--\r\n            (1) be offered equivalent positions on the Commission \r\n        staff, as determined by the Commission, and submit to the \r\n        Commission's standard employment policies; and\r\n            (2) receive pay that is not higher than the highest paid \r\n        employee of similarly situated employees of the Commission.\r\n    (d) In this section, the term ``transfer date'' means the date \r\nestablished by the Commission for purposes of this section, except that \r\nsuch date may not be later than the date that is 1 year after the date \r\nof enactment of this Act.",
    "summary": "Abolishes the PCAOB within one year (\"transfer date\") and folds its duties—registration of audit firms, inspections, standard‑setting, and all pending enforcement cases—into the Securities and Exchange Commission. All PCAOB intellectual property must be shared immediately and transferred on the deadline. Unobligated fee balances (≈$190 million) are swept into the Treasury, and the SEC is barred from collecting the annual accounting‑support fees that have financed the PCAOB since 2003. Current PCAOB staff may apply for SEC jobs, but salaries cannot exceed comparable SEC pay grades.",
    "impact": "Creates a one‑time Treasury windfall and modest ongoing savings (audit‑support fees average $330 million/yr) but unwinds a post‑Enron reform meant to keep audit policing independent of politics. The SEC must absorb ~850 personnel, migrate two decades of inspection data into EDGAR/OCA systems, and revise auditing standards—tasks that could delay broader rulemakings. Investor advocates fear the merger will dilute audit‑investigation independence, whereas large firms welcome a single regulator. If Congress later restores user‑fees to fund inspections, smaller firms could face higher per‑audit assessments.",
    "additionalReferences": [
      "https://pcaobus.org/about/accounting-support-fee",
      "https://www.ft.com/content/e9a7247f-84fd-4df7-8163-6518954470e9"
    ],
    "tags": [
      "financial regulation",
      "SEC",
      "audit oversight",
      "public accountability",
      "corporate transparency",
      "investor protection",
      "agency consolidation",
      "PCAOB",
      "federal workforce",
      "cost savings"
    ]
  },
  {
    "titleNumber": "V",
    "subtitle": "",
    "sectionNumber": "50003",
    "sectionTitle": "Bureau of Consumer Financial Protection",
    "sectionText": "SEC. 50003. BUREAU OF CONSUMER FINANCIAL PROTECTION.\r\n\r\n    Section 1017(a)(2) of the Consumer Financial Protection Act of 2010 \r\n(12 U.S.C. 5497(a)(2)) is amended--\r\n            (1) in subparagraph (A)(iii)--\r\n                    (A) by striking ``12 percent'' and inserting ``5 \r\n                percent''; and\r\n                    (B) by striking ``2013'' and inserting ``2025''; \r\n                and\r\n            (2) by striking subparagraph (C) and inserting the \r\n        following:\r\n                    ``(C) Limitation on unobligated balances.--With \r\n                respect to a fiscal year, the amount of unobligated \r\n                balances of the Bureau may not exceed 5 percent of the \r\n                dollar amount referred to in subparagraph (A)(iii), as \r\n                adjusted under subparagraph (B). The Director shall \r\n                transfer any excess amount of such unobligated balances \r\n                to the general fund of the Treasury.''.",
    "summary": "Cuts the CFPB’s automatic Federal Reserve draw cap from 12 % to 5 % of Fed operating expenses beginning FY 2025—dropping the theoretical ceiling from about $750 million to roughly $330 million—and limits the Bureau’s unobligated year‑end balance to 5 % of that amount, with any excess swept to the Treasury.",
    "impact": "Slashes CFPB budget authority by ~56 %, likely forcing staff reductions, scaled‑back supervision of non‑bank fintechs, and delays in rules on open banking, credit‑card late fees, and AI underwriting. Industry advocates say the measure restores Congressional oversight to an “unaccountable” agency; consumer‑protection groups counter that weaker enforcement will cost households billions in junk‑fee overcharges and embolden repeat violators. Litigation over the Bureau’s funding structure—recently upheld by the Supreme Court—could intensify if operations are curtailed.",
    "additionalReferences": [
      "https://www.nortonrosefulbright.com/en/knowledge/publications/736842c4/supreme-court-rules-cfpb-funding-structure-is-lawful",
      "https://www.hklaw.com/en/insights/publications/2025/06/us-house-of-representatives-approves-70-percent-cut-to-cfpb-funding"
    ],
    "tags": [
      "consumer protection",
      "financial regulation",
      "CFPB",
      "budget caps",
      "agency funding",
      "Fed",
      "banking",
      "credit",
      "regulatory enforcement",
      "fintech"
    ]
  },
  {
    "titleNumber": "V",
    "subtitle": "",
    "sectionNumber": "50004",
    "sectionTitle": "Consumer Financial Civil Penalty Fund",
    "sectionText": "SEC. 50004. CONSUMER FINANCIAL CIVIL PENALTY FUND.\r\n\r\n    Section 1017(d) of the Consumer Financial Protection Act of 2010 \r\n(12 U.S.C. 5497(d)) is amended--\r\n            (1) in paragraph (2)--\r\n                    (A) in the first sentence, by inserting ``direct'' \r\n                before ``victims''; and\r\n                    (B) by striking the second sentence; and\r\n            (2) by adding at the end the following:\r\n            ``(3) Treatment of excess amounts.--With respect to a civil \r\n        penalty described under paragraph (1), if the Bureau makes \r\n        payments to all of the direct victims of activities for which \r\n        that civil penalty was imposed, the Bureau shall transfer all \r\n        amounts that remain in the Civil Penalty Fund with respect to \r\n        that civil penalty to the general fund of the Treasury.''.",
    "summary": "Restricts Civil Penalty Fund disbursements to direct consumer victims only and requires any remaining balance—after victims are fully compensated—to be transferred to the Treasury, eliminating the Bureau’s ability to finance consumer‑education or future redress in unrelated matters.",
    "impact": "Treasury gains intermittent inflows (historically $25–40 million/yr) at the expense of financial‑literacy grants and relief for indirect or unidentified victims. Large enforcement cases with incomplete victim records (e.g., phantom‑debt schemes) may now yield little restitution. Proponents say the change ends an \"off‑budget slush fund\"; critics argue it undercuts the Bureau’s capacity to rectify widespread but diffuse consumer harms.",
    "additionalReferences": [
      "https://files.consumerfinance.gov/f/documents/cfpb_financial-report-fy-2024.pdf",
      "https://files.consumerfinance.gov/f/documents/cfpb_civil-penalty-fund_factsheet.pdf"
    ],
    "tags": [
      "consumer protection",
      "CFPB",
      "financial redress",
      "penalties",
      "Treasury",
      "victim compensation",
      "civil penalties",
      "regulatory enforcement",
      "financial literacy",
      "budget transfers"
    ]
  },
  {
    "titleNumber": "V",
    "subtitle": "",
    "sectionNumber": "50005",
    "sectionTitle": "Financial Research Fund",
    "sectionText": "SEC. 50005. FINANCIAL RESEARCH FUND.\r\n\r\n    Section 155 of the Financial Stability Act of 2010 (12 U.S.C. 5345) \r\nis amended by adding at the end the following:\r\n    ``(e) Limitation on Assessments and the Financial Research Fund.--\r\n            ``(1) Limitation on assessments.--Assessments may not be \r\n        collected under subsection (d) if the assessments would result \r\n        in--\r\n                    ``(A) the Financial Research Fund exceeding the \r\n                average annual budget amount; or\r\n                    ``(B) the total assessments collected during a \r\n                single fiscal year exceeding the average annual budget \r\n                amount.\r\n            ``(2) Transfer of excess funds.--Any amounts in the \r\n        Financial Research Fund exceeding the average annual budget \r\n        amount shall be deposited into the general fund of the \r\n        Treasury.\r\n            ``(3) Average annual budget amount defined.--In this \r\n        subsection the term `average annual budget amount' means the \r\n        annual average, over the 3 most recently completed fiscal \r\n        years, of the expenses of the Council in carrying out the \r\n        duties and responsibilities of the Council that were paid by \r\n        the Office using amounts obtained through assessments under \r\n        subsection (d).''.",
    "summary": "Caps both the size of the Treasury Office of Financial Research’s reserve and its annual bank‑assessment collections at the “average annual budget amount” (three‑year trailing average, currently ≈$95 million). Once that limit is reached in any fiscal year, assessments must cease and any balance above the cap is swept to the Treasury.",
    "impact": "Prevents OFR from rebuilding its pre‑sequester $200 million reserve, potentially curbing long‑term projects such as climate‑scenario analysis, repo‑market data hubs, and expanded LEI adoption. Large bank‑holding companies will see marginal fee relief, but FSOC may have to seek emergency appropriations in a future crisis. Observers warn the cap could degrade the early‑warning system created after 2008, while supporters claim OFR had amassed an \"idle cash buffer.\"",
    "additionalReferences": [
      "https://home.treasury.gov/system/files/266/15.-OFR-FY-2025-CJ.pdf",
      "https://www.ft.com/content/7962a211-a663-4ec0-99ed-1bde012bb0d8"
    ],
    "tags": [
      "financial regulation",
      "systemic risk",
      "Treasury",
      "bank assessments",
      "climate risk",
      "financial stability",
      "OFR",
      "budget caps",
      "early warning systems",
      "repo markets"
    ]
  }
]