[
  {
    "titleNumber": "VII",
    "subtitle": "C",
    "sectionNumber": "70300",
    "sectionText": "SEC. 70300. LIMITATION ON DONATIONS MADE PURSUANT TO SETTLEMENT \r\n              AGREEMENTS TO WHICH THE UNITED STATES IS A PARTY.\r\n\r\n    (a) Limitation on Required Donations.--An official within the \r\nDepartment of Justice may not enter into or enforce any settlement \r\nagreement on behalf of the United States directing or providing for a \r\npayment to any person or entity other than the United States, other \r\nthan a payment that provides restitution for or otherwise directly \r\nremedies actual harm (including to the environment) directly and \r\nproximately caused by the party making the payment, or constitutes \r\npayment for services rendered in connection with the case.\r\n    (b) Penalty.--Any official within the Department of Justice who \r\nviolates subsection (a) shall be subject to the same penalties that \r\nwould apply in the case of a violation of section 3302 of title 31, \r\nUnited States Code.\r\n    (c) Effective Date.--Subsections (a) and (b) apply only in the case \r\nof a settlement agreement entered on or after the date of enactment of \r\nthis Act.\r\n    (d) Definition.--The term ``settlement agreement'' means a \r\nsettlement agreement resolving a civil action or potential civil \r\naction.\r\n    (e) Annual Audit Requirement.--\r\n            (1) In general.--Not later than at the end of the first \r\n        fiscal year that begins after the date of enactment of this \r\n        Act, and annually thereafter, the Inspector General of the \r\n        Department of Justice shall submit, and make available on a \r\n        publicly accessible website, a report on any settlement \r\n        agreement entered into in violation of this section to--\r\n                    (A) the Committee on the Judiciary of the Senate; \r\n                and\r\n                    (B) the Committee on the Judiciary of the House of \r\n                Representatives.\r\n            (2) Prohibition on additional funding.--No additional funds \r\n        are authorized to be appropriated to carry out this subsection.",
    "sectionTitle": "Limitation on Donations Made Pursuant to Settlement Agreements to Which the United States Is a Party",
    "summary": "Bars the Department of Justice (DOJ) from negotiating or enforcing civil‑case settlements that direct cash or in‑kind payments to third parties other than the United States, unless those payments (1) directly compensate victims or remediate tangible harms caused by the defendant, or (2) pay for services rendered in the litigation.  A violation is treated as a breach of the Miscellaneous Receipts Act, subjecting the offending DOJ official to the same penalties as misappropriation of public money.  Applies prospectively and instructs the DOJ Inspector General to audit and publicly report any non‑compliant settlements each fiscal year without new appropriations.",
    "impact": "•  **Ends third‑party payment provisions** often used in environmental and financial‑fraud settlements and forces any such funds into the U.S. Treasury, strengthening congressional control over spending.  \n•  **Could raise litigation costs** by removing a flexible bargaining chip that allowed defendants to satisfy community stakeholders without larger fines, potentially lengthening negotiations and increasing civil‑penalty demands.  \n•  **Enhanced oversight** via mandatory IG audits increases transparency but may divert DOJ resources and reduce latitude for creative remedial projects (e.g., Supplemental Environmental Projects).",
    "additionalReferences": [
      "https://uscode.house.gov/view.xhtml?req=granuleid:USC-prelim-title31-section3302",
      "https://www.gao.gov/products/GAO-18-183",
      "https://crsreports.congress.gov/product/pdf/R/R45442"
    ],
    "tags": [
      "DOJ",
      "settlements",
      "miscellaneous receipts",
      "appropriations",
      "oversight",
      "environment",
      "financial fraud",
      "audits",
      "enforcement",
      "transparency",
      "compliance",
      "law enforcement",
      "community development"
    ]
  },
  {
    "titleNumber": "VII",
    "subtitle": "C",
    "sectionNumber": "70301",
    "sectionText": "SEC. 70301. SOLICITATION OF ORDERS DEFINED.\r\n\r\n    Section 101(d) of Public Law 86--272 (73 Stat. 555) is amended--\r\n            (1) in paragraph (1) by striking ``and'' at the end,\r\n            (2) in paragraph (2) by striking the period at the end and \r\n        inserting ``; and'', and\r\n            (3) by adding at the end the following:\r\n            ``(3) the term `solicitation of orders' means any business \r\n        activity that facilitates the solicitation of orders even if \r\n        that activity may also serve some independently valuable \r\n        business function apart from solicitation.''.",
    "sectionTitle": "Solicitation of Orders Defined",
    "summary": "Amends § 101(d) of Public Law 86‑272 (the 1959 interstate income‑tax safe harbor) to broaden the definition of “solicitation of orders.”  Under the new language, any business activity that facilitates solicitation— even if it also serves an independent business purpose— is considered protected solicitation.",
    "impact": "•  **Narrows states’ ability to impose income taxes** on out‑of‑state companies that engage in ancillary activities (e.g., tech‑support chats, virtual product demos) by reaffirming their protection under P.L. 86‑272.  \n•  **Counters recent state guidance**—notably the Multistate Tax Commission’s 2021 statement—that digital post‑sale interactions can create tax nexus; litigation challenging those positions will likely cite this amendment.  \n•  **Potential revenue loss** for high‑population states that expanded nexus theories after *South Dakota v. Wayfair* (2018).",
    "additionalReferences": [
      "https://www.govinfo.gov/content/pkg/STATUTE-73/pdf/STATUTE-73-Pg555.pdf",
      "https://www.mtc.gov/wp-content/uploads/2021/09/PL86-272-Statement-of-Information.pdf",
      "https://www.ncsl.org/financial-services/pl-86-272-and-state-taxation"
    ],
    "tags": [
      "tax policy",
      "commerce",
      "digital services",
      "interstate commerce",
      "state policy",
      "federal pre-emption",
      "revenue",
      "business support"
    ]
  },
  {
    "titleNumber": "VII",
    "subtitle": "C",
    "sectionNumber": "70302",
    "sectionText": "SEC. 70302. RESTRICTION ON ENFORCEMENT.\r\n\r\n    No court of the United States may enforce a contempt citation for \r\nfailure to comply with an injunction or temporary restraining order if \r\nno security was given when the injunction or order was issued pursuant \r\nto Federal Rule of Civil Procedure 65(c), whether issued prior to, on, \r\nor subsequent to the date of enactment of this section.",
    "sectionTitle": "Restriction on Enforcement",
    "summary": "Prohibits federal courts from enforcing contempt citations for non‑compliance with an injunction or temporary restraining order if the issuing court failed to require security (a bond) under Federal Rule of Civil Procedure 65(c), regardless of when the injunction was issued.",
    "impact": "•  **Elevates Rule 65(c) bond requirement** from discretionary to effectively mandatory by stripping courts of contempt power when no security is posted, compelling judges to set a bond or risk unenforceability.  \n•  **Shields defendants**—especially small businesses and state governments—from injunctions issued without security, reducing exposure to coercive sanctions but potentially weakening immediate relief for plaintiffs in civil‑rights, environmental, or consumer‑protection cases.  \n•  **Creates retroactive vulnerability**: existing injunctions lacking a bond become toothless until security is posted or the order is re‑issued, likely prompting a wave of modification motions and procedural challenges.",
    "additionalReferences": [
      "https://www.law.cornell.edu/rules/frcp/rule_65",
      "https://supreme.justia.com/cases/federal/us/527/308/",
      "https://legalsolutions.thomsonreuters.com/en/products/federal-practice-and-procedure (treatise overview)"
    ],
    "tags": [
      "judicial review",
      "civil rights",
      "environment",
      "consumer protection",
      "legal process",
      "Rule 65",
      "injunctions",
      "small business",
      "states",
      "compliance"
    ]
  }
]