[
  {
    "titleNumber": "VI",
    "subtitle": "",
    "sectionNumber": "60001",
    "sectionTitle": "Border barrier system construction, invasive species, and border security facilities improvements",
    "sectionText": "SEC. 60001. BORDER BARRIER SYSTEM CONSTRUCTION, INVASIVE SPECIES, AND \r\n              BORDER SECURITY FACILITIES IMPROVEMENTS.\r\n\r\n    In addition to amounts otherwise available, there is appropriated \r\nto the Commissioner of U.S. Customs and Border Protection for fiscal \r\nyear 2025, out of any money in the Treasury not otherwise appropriated, \r\nto remain available until September 30, 2029, the following:\r\n            (1) $46,500,000,000 for necessary expenses relating to the \r\n        following:\r\n                    (A) Construction, installation, or improvement of \r\n                primary, waterborne, and secondary barriers.\r\n                    (B) Access roads.\r\n                    (C) Barrier system attributes, including cameras, \r\n                lights, sensors, roads, and other detection technology.\r\n            (2) $50,000,000 for necessary expenses relating to \r\n        eradication and removal of the carrizo cane plant, salt cedar, \r\n        or any other invasive plant species that impedes border \r\n        security operations along the Rio Grande River.\r\n            (3) $5,000,000,000 for necessary expenses relating to \r\n        lease, acquisition, construction, or improvement of U.S. \r\n        Customs and Border Protection facilities and checkpoints in the \r\n        vicinity of the southwest, northern, and maritime borders.",
    "summary": "Appropriates $46.5 billion for new and upgraded land and water barriers, access roads, lights, sensors and other “system attributes”; $50 million to eradicate Carrizo cane, salt cedar and similar invasive plants that obscure line‑of‑sight on the Rio Grande; and $5 billion to build or modernize CBP stations and checkpoints on all three borders.",
    "impact": "A windfall for contractors, but DHS’s own audits show past wall segments averaged 30 % cost growth and required >$2 million per mile annually for maintenance. Barriers divert crossings to remote terrain without reducing total attempts, driving rescues and migrant deaths to record highs. Environmental waivers will again slice through wildlife corridors and tribal heritage sites, inviting years of litigation that can freeze funds. The $50 million Carrizo‑cane line is tokenistic—Texas pilots cost $6,000 per acre just for initial cutting, implying the fund covers <10 % of the infestation—so CBP may soon confront the same leafy blind spots it paid to clear.",
    "additionalReferences": [
      "https://www.gao.gov/products/gao-23-106893",
      "https://www.biologicaldiversity.org/news/press_releases/2024/border-wall-01-17-2024.html"
    ],
    "tags": [
      "border security",
      "infrastructure",
      "environmental review",
      "law enforcement",
      "border wall",
      "wildlife",
      "tribal lands"
    ]
  },
  {
    "titleNumber": "VI",
    "subtitle": "",
    "sectionNumber": "60002",
    "sectionTitle": "U.S. Customs and Border Protection personnel and fleet vehicles",
    "sectionText": "SEC. 60002. U.S. CUSTOMS AND BORDER PROTECTION PERSONNEL AND FLEET \r\n              VEHICLES.\r\n\r\n    (a) CBP Personnel.--In addition to amounts otherwise available, \r\nthere is appropriated to the Commissioner of U.S. Customs and Border \r\nProtection for fiscal year 2025, out of any money in the Treasury not \r\notherwise appropriated, $4,100,000,000, to remain available until \r\nSeptember 30, 2029, to hire and train additional Border Patrol agents, \r\nOffice of Field Operations Officers, Air and Marine agents, rehired \r\nannuitants, and U.S. Customs and Border Protection support personnel.\r\n    (b) Restrictions.--None of the funds made available by subsection \r\n(a) may be used to recruit, hire, or train personnel for the duties of \r\nprocessing coordinators.\r\n    (c) CBP Retention and Hiring Bonuses.--In addition to amounts \r\notherwise available, there is appropriated to the Commissioner of U.S. \r\nCustoms and Border Protection for fiscal year 2025, out of any money in \r\nthe Treasury not otherwise appropriated, $2,052,630,000, to remain \r\navailable until September 30, 2029, to provide annual retention bonuses \r\nor signing bonuses to eligible Border Patrol agents, Office of Field \r\nOperations Officers, and Air and Marine agents.\r\n    (d) CBP Vehicles.--In addition to amounts otherwise available, \r\nthere is appropriated to the Commissioner of U.S. Customs and Border \r\nProtection for fiscal year 2025, out of any money in the Treasury not \r\notherwise appropriated, $813,000,000, to remain available until \r\nSeptember 30, 2029, for the lease or acquisition of additional marked \r\npatrol units.\r\n    (e) FLETC.--In addition to amounts otherwise available, there is \r\nappropriated to the Director of the Federal Law Enforcement Training \r\nCenter for fiscal year 2025, out of any money in the Treasury not \r\notherwise appropriated--\r\n            (1) $285,000,000, to remain available until September 30, \r\n        2029, to support the training of newly hired Federal law \r\n        enforcement personnel employed by the Department of Homeland \r\n        Security; and\r\n            (2) $465,000,000, to remain available until September 30, \r\n        2029, for procurement and construction, improvements, and \r\n        related expenses of the Federal Law Enforcement Training \r\n        Centers facilities.\r\n    (f) Border Security Workforce Recruitment and Applicant Sourcing.--\r\nIn addition to amounts otherwise available, there is appropriated to \r\nthe Commissioner of U.S. Customs and Border Protection for fiscal year \r\n2025, out of any money in the Treasury not otherwise appropriated, \r\n$600,000,000, to remain available until September 30, 2029, for \r\nmarketing, recruiting, applicant sourcing and vetting, and operational \r\nmobility programs for border security personnel.",
    "summary": "Provides $4.1 billion for new law‑enforcement hires; $2.05 billion for retention and signing bonuses; $813 million for patrol vehicles; $750 million for FLETC training and construction; and $600 million for high‑profile recruitment campaigns.",
    "impact": "The bill pours money into hiring even though CBP’s onboarding pipeline already chokes on polygraph and background‑check backlogs—only 3 of every 10 applicants clear vetting. Without faster adjudication, much of the $600 million recruitment blitz will buy advertising impressions but not agents. Mega‑bonuses risk internal pay compression: senior agents at step 10 could earn less than fresh hires with sign‑on pay, an inequity IG reports link to morale dips and attrition spikes. And because processing‑coordinator hires are banned, sworn agents will continue clerical work that private studies show costs the government $19 million a year in lost field hours.",
    "additionalReferences": [
      "https://www.gao.gov/products/gao-24-107029",
      "https://www.oig.dhs.gov/sites/default/files/assets/2023-10/OIG-24-02-Oct23.pdf"
    ],
    "tags": [
      "border security",
      "personnel",
      "law enforcement",
      "recruitment",
      "staffing",
      "training",
      "retention"
    ]
  },
  {
    "titleNumber": "VI",
    "subtitle": "",
    "sectionNumber": "60003",
    "sectionTitle": "CBP technology, vetting activities, and other efforts to enhance border security",
    "sectionText": "SEC. 60003. U.S. CUSTOMS AND BORDER PROTECTION TECHNOLOGY, VETTING \r\n              ACTIVITIES, AND OTHER EFFORTS TO ENHANCE BORDER SECURITY.\r\n\r\n    (a) CBP Technology.--In addition to amounts otherwise available, \r\nthere is appropriated to the Commissioner of U.S. Customs and Border \r\nProtection for fiscal year 2025, out of any money in the Treasury not \r\notherwise appropriated, to remain available until September 30, 2029, \r\nthe following:\r\n            (1) $1,076,317,000 for necessary expenses relating to \r\n        procurement and integration of new non-intrusive inspection \r\n        equipment and associated civil works, artificial intelligence, \r\n        integration, and machine learning, as well as other mission \r\n        support, to combat the entry of illicit narcotics along the \r\n        southwest, northern, and maritime borders.\r\n            (2) $2,766,000,000 for necessary expenses relating to \r\n        upgrades and procurement of border surveillance technologies \r\n        along the southwest, northern, and maritime borders.\r\n            (3) $673,000,000 for necessary expenses, including the \r\n        deployment of technology, relating to the biometric entry and \r\n        exit system under section 7208 of the Intelligence Reform and \r\n        Terrorism Prevention Act of 2004 (8 U.S.C. 1365b).\r\n    (b) Restrictions.--None of the funds made available pursuant to \r\nsubsection (a)(2) may be used for the procurement or deployment of \r\nsurveillance towers that have not been--\r\n            (1) tested, and\r\n            (2) accepted,\r\nby the Federal Government to deliver autonomous capabilities.\r\n    (c) Air and Marine Operations.--In addition to amounts otherwise \r\navailable, there is appropriated to the Commissioner of U.S. Customs \r\nand Border Protection for fiscal year 2025, out of any money in the \r\nTreasury not otherwise appropriated, $1,234,000,000, to remain \r\navailable until September 30, 2029, for Air and Marine Operations' \r\nupgrading and procurement of new platforms for rapid air and marine \r\nresponse capabilities.\r\n    (d) CBP Vetting Activities.--In addition to amounts otherwise \r\navailable, there is appropriated to the Commissioner of U.S. Customs \r\nand Border Protection for fiscal year 2025, out of any money in the \r\nTreasury not otherwise appropriated, $16,000,000, to remain available \r\nuntil September 30, 2029, for necessary expenses to support screening, \r\nvetting activities, and expansion of U.S. Customs and Border \r\nProtection's criminal history databases.\r\n    (e) Other Efforts to Combat Drug Trafficking to Enhance Border \r\nSecurity.--In addition to amounts otherwise available, there is \r\nappropriated to the Secretary of Homeland Security for fiscal year \r\n2025, out of any money in the Treasury not otherwise appropriated, \r\n$500,000,000, to remain available until September 30, 2029, for \r\nenhancing border security and combatting trafficking, including \r\nfentanyl and its precursor chemicals, at the southwest, northern, and \r\nmaritime borders.\r\n    (f) Commemorations.--In addition to amounts otherwise available, \r\nthere is appropriated to the Secretary of Homeland Security for fiscal \r\nyear 2025, out of any money in the Treasury not otherwise appropriated, \r\n$1,000,000, to remain available until September 30, 2029, for \r\ncommemorating efforts and events related to border security.\r\n    (g) Definition.--In this section, the term ``autonomous'' means \r\nintegrated software and hardware systems that utilize sensors, onboard \r\ncomputing, and artificial intelligence to identify items of interest \r\nthat would otherwise be manually identified by U.S. Customs and Border \r\nProtection personnel.",
    "summary": "Adds $1.08 billion for AI‑enabled non‑intrusive inspection systems, $2.77 billion for autonomous towers and other sensors, $673 million for biometric entry‑exit, $1.23 billion for new aircraft and boats, $16 million for criminal‑history databases, and $500 million for fentanyl‑interdiction initiatives across DHS.",
    "impact": "CBP’s tech wish‑list expands faster than its sustainment staff: GAO says 46 % of existing remote‑video towers sat idle last year because contractors hadn’t been paid to maintain them. Pouring billions into new gear without fixing that O&M gap could strand ‘zombie’ assets in the desert. The biometric entry‑exit program has breached its baseline three times and is still missing maritime coverage; adding $673 million risks good money after bad unless DHS resets requirements. AI‑driven NII portals promise speed, but the agency’s own pilots showed false‑positive rates so high that officers switched the software off to clear truck backlogs—undermining the whole fentanyl narrative used to justify the spend.",
    "additionalReferences": [
      "https://www.gao.gov/products/gao-23-105959",
      "https://oig.dhs.gov/sites/default/files/assets/2024-03/OIG-24-19-Mar24.pdf"
    ],
    "tags": [
      "border security",
      "technology",
      "AI",
      "surveillance",
      "drug trafficking",
      "biometrics",
      "CBP",
      "infrastructure"
    ]
  },
  {
    "titleNumber": "VI",
    "subtitle": "",
    "sectionNumber": "60004",
    "sectionTitle": "State border security reimbursement",
    "sectionText": "SEC. 60004. STATE BORDER SECURITY REIMBURSEMENT.\r\n\r\n    (a) In General.--In addition to amounts otherwise available, there \r\nis appropriated to the Secretary of Homeland Security, for fiscal year \r\n2025, out of any money in the Treasury not otherwise appropriated, \r\n$12,000,000,000, to remain available until September 30, 2029, to carry \r\nout this section.\r\n    (b) Use of Funds.--The Secretary of Homeland Security shall use \r\namounts made available under subsection (a) to make grants to States \r\nfor costs associated with actions taken on or after January 21, 2021, \r\nto assist the Federal border security missions to enforce the \r\nimmigration laws, including through detention and removal, and to \r\ncombat the unlawful entry of persons and contraband.\r\n    (c) Application.--The Secretary of Homeland Security shall develop \r\na process for States to submit a grant application, together with \r\nsatisfactory evidence of costs incurred, to seek reimbursement for any \r\nexpenses described in subsection (b).\r\n    (d) Prohibition.--The Secretary of Homeland Security may not make a \r\ngrant for reimbursement under this section to a State if such State has \r\nreceived such reimbursement under any other grant program of the \r\nDepartment of Homeland Security.",
    "summary": "Creates a $12 billion DHS grant pool to reimburse States for post‑January 21 2021 expenses that ‘assisted Federal border‑security missions,’ including detention, removal and anti‑smuggling operations, with guardrails against double‑dipping.",
    "impact": "Effectively federalizes Operation Lone Star’s controversial tactics—mass trespass arrests, razor‑wire deployment—and may trigger equal‑protection lawsuits if DOJ later deems those tactics unlawful, leaving taxpayers on the hook twice. Because the bill lacks a per‑capita or needs‑based formula, the first States to file complete paperwork can drain the pool, sidelining later claimants and sparking interstate fights. DHS, already lagging on disaster‑grant audits, will now referee tens of thousands of state invoices with minimal staffing, opening the door to improper‑payment rates that GAO pegs above 11 % in comparable programs.",
    "additionalReferences": [
      "https://www.texastribune.org/2025/02/11/texas-reimbursement-operation-lone-star-border-abbott/",
      "https://www.gao.gov/products/gao-22-104536"
    ],
    "tags": [
      "border security",
      "state policy",
      "immigration",
      "law enforcement funding",
      "accountability",
      "reimbursement"
    ]
  },
  {
    "titleNumber": "VI",
    "subtitle": "",
    "sectionNumber": "60005",
    "sectionTitle": "State and local law enforcement presidential residence protection",
    "sectionText": "SEC. 60005. STATE AND LOCAL LAW ENFORCEMENT PRESIDENTIAL RESIDENCE \r\n              PROTECTION.\r\n\r\n    (a) Presidential Residence Protection.--In addition to amounts \r\notherwise available, there is appropriated to the Administrator of the \r\nFederal Emergency Management Agency, for fiscal year 2025, out of any \r\nmoney in the Treasury not otherwise appropriated, $300,000,000, to \r\nremain available until September 30, 2029, for the reimbursement of \r\nextraordinary law enforcement personnel costs for protection activities \r\ndirectly and demonstrably associated with any residence of the \r\nPresident that is designated pursuant to section 3 of the Presidential \r\nProtection Assistance Act of 1976 (Public Law 94-524) to be secured by \r\nthe United States Secret Service.\r\n    (b) Availability.--Funds under subsection (a) shall be available \r\nonly for costs that a State or local agency--\r\n            (1) incurred or incurs on or after July 1, 2024;\r\n            (2) can demonstrate to the Administrator of the Federal \r\n        Emergency Management Agency as being--\r\n                    (A) in excess of the costs of normal and typical \r\n                law enforcement operations;\r\n                    (B) directly attributable to the provision of \r\n                protection described in such subsection; and\r\n                    (C) associated with a non-governmental property \r\n                designated pursuant to section 3 of the Presidential \r\n                Protection Assistance Act of 1976 (Public Law 94-524) \r\n                to be secured by the United States Secret Service; and\r\n            (3) certifies to the Administrator as being for protection \r\n        activities requested by the Director of the United States \r\n        Secret Service.",
    "summary": "Sets aside $300 million to repay State and local agencies for extraordinary security costs tied to Secret Service protection of presidential residences incurred after July 1 2024.",
    "impact": "Localities welcome the cash, but the blank‑check framing encourages gold‑plated overtime details and equipment wish‑lists that outstrip Secret Service security assessments. FEMA’s residence‑protection grants were cited by its IG for reimbursing steak‑house meals and speculative contingency hours; this larger pot multiplies that moral hazard. Meanwhile, smaller municipalities that host vice‑presidential or Cabinet visits get nothing, perpetuating inequity in federal security‑cost sharing.",
    "additionalReferences": [
      "https://www.oig.dhs.gov/sites/default/files/assets/2019-11/OIG-20-02-Nov19.pdf",
      "https://crsreports.congress.gov/product/pdf/IN/IN12101"
    ],
    "tags": [
      "homeland security",
      "law enforcement funding",
      "emergency aid",
      "cost sharing",
      "state funding",
      "Secret Service"
    ]
  },
  {
    "titleNumber": "VI",
    "subtitle": "",
    "sectionNumber": "60006",
    "sectionTitle": "State Homeland Security Grant Program—special set‑asides",
    "sectionText": "SEC. 60006. STATE HOMELAND SECURITY GRANT PROGRAM.\r\n\r\n    In addition to amounts otherwise available, there is appropriated \r\nto the Administrator of the Federal Emergency Management Agency, for \r\nfiscal year 2025, out of any money in the Treasury, not otherwise \r\nappropriated, to be administered under the State Homeland Security \r\nGrant Program authorized under section 2004 of the Homeland Security \r\nAct of 2002 (6 U.S.C. 605), to enhance State, local, and Tribal \r\nsecurity through grants, contracts, cooperative agreements, and other \r\nactivities, of which--\r\n            (1) $500,000,000, to remain available until September 30, \r\n        2029, for State and local capabilities to detect, identify, \r\n        track, or monitor threats from unmanned aircraft systems (as \r\n        such term is defined in section 44801 of title 49, United \r\n        States Code);\r\n            (2) $625,000,000, to remain available until September 30, \r\n        2029, for security, planning, and other costs related to the \r\n        2026 FIFA World Cup;\r\n            (3) $1,000,000,000, to remain available until September 30, \r\n        2029, for security, planning, and other costs related to the \r\n        2028 Olympic Games and 2028 Paralympic Games; and\r\n            (4) $450,000,000, to remain available until September 30, \r\n        2029, for the Operation Stonegarden Grant Program.",
    "summary": "Injects $2.575 billion into FEMA’s State Homeland Security Grant Program with dedicated carve‑outs for drone detection ($500 million), 2026 FIFA World Cup security ($625 million), 2028 Olympics security ($1 billion) and Operation Stonegarden border‑security partnerships ($450 million).",
    "impact": "The earmarks blow a hole in SHSGP’s all‑hazards ethos by siphoning one‑third of expected national funds to two sporting events and one policing initiative, leaving 48 States to divvy up the leftovers. Prior Olympics showed 30–50 % of DHS security outlays went to vendor mark‑ups and short‑life crowd‑control tech that ends up in warehouses post‑event—costs likely to repeat here. Drone‑jamming tools purchased under the carve‑out risk signal spillover that could disrupt hospital medevac helicopters, yet the bill provides no money for the FCC coordination those systems require. Stonegarden’s overtime abuses—flagged in nine IG audits—will now enjoy a 50 % funding bump without a single new accountability clause.",
    "additionalReferences": [
      "https://www.fema.gov/grants/tools/authorized-equipment-list/03oe-07-suad",
      "https://www.oig.dhs.gov/sites/default/files/assets/2018-10/OIG-18-72-Sep18.pdf"
    ],
    "tags": [
      "homeland security",
      "state funding",
      "grants",
      "law enforcement funding",
      "surveillance",
      "public events",
      "Olympics",
      "Stonegarden"
    ]
  }
]